------------------------------------------------------------------------------------------------------
      name:  IRDC_Resultados
       log:  C:\Users\morenos\OneDrive - STJ- Superior Tribunal de Justi√ßa\UnB\Mestrado em Governan√ßa 
> e Inova√ß√£o em Pol√≠ticas P√∫blicas\Projeto\Dados\Diretorio Stata\Resultados\IRDC.log
  log type:  text
 opened on:   5 Jun 2025, 19:12:19

. 
. 
. /*******************************************************************************
> ETAPA 1 - IMPORTA√á√ÉO, AN√ÅLISE DESCRITIVA DAS VARI√ÅVEIS E TRANSFORMA√á√ÉO 
> *******************************************************************************/
. * Definindo o diret√≥rio de trabalho e importando os dados do Excel
. cd "`basedados'"
C:\Users\morenos\OneDrive - STJ- Superior Tribunal de Justi√ßa\UnB\Mestrado em Governan√ßa e Inova√ß√£o em
>  Pol√≠ticas P√∫blicas\Projeto\Dados\Diretorio Stata

. import excel "Dados_novo.xlsx", sheet("Tabela 4") firstrow clear
(37 vars, 931 obs)

. 
. /*******************************************************************************
> 1.1 - Executar estat√≠sticas descritivas para todas as vari√°veis
> *******************************************************************************/
. summarize LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid IndepFin ImobilPL ImobRecN
> C PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato QtdeCNAEsSecundarios IdadedeAnos QtePenal
> OutrosOrgaos

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 LiqCorrente |        931    20.27115    175.2277     -65.24    4449.37
    LiqGeral |        931    17.79793    173.2711     -65.24    4449.37
 LiqCorAjust |        931    .4205884    .3556316    -3.6773          1
   SolvGeral |        931    23.42267    220.6801     -66.99    4449.37
    EndGeral |        931    1.119794    8.035152  -208.1876    34.6218
-------------+---------------------------------------------------------
 CompEndivid |        931    .7853853    .2551754          0          1
    IndepFin |        931    22.42819    220.6795   -67.9885   4448.367
    ImobilPL |        931    .1717159    3.294931   -95.5357     9.1728
   ImobRecNC |        931    .2082625     .252257     -.2471     1.4904
 PtpCapTerce |        931    1.119794    8.035152  -208.1876    34.6218
-------------+---------------------------------------------------------
   GiroAtivo |        931    1.567206    1.750998     -.0289    32.9637
      MargOp |        931    .8386915    11.44148    -1.4199   348.9034
     MargLiq |        931    .1716029    2.190555   -14.1571    60.8893
         ROI |        931    .1539564    .9351267    -25.837     3.6612
         ROE |        931    .4404016    2.541514    -3.9973    70.7696
-------------+---------------------------------------------------------
 vlrcontrato |        336    1.23e+07    2.52e+07   23769.99   1.34e+08
QtdeCNAEsS~s |        931    15.39527    14.31003          1         97
 IdadedeAnos |        931    22.64656    10.94995   .5041096   58.89315
QtePenalOu~s |        931    5.508056    20.42007          0        201

. 
. * Estat√≠sticas descritivas separadas por penaliza√ß√£o
. by FoiPenalizadoSTJ, sort: summarize LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid
>  IndepFin ImobilPL ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato QtdeCNAEsSecun
> darios IdadedeAnos QtePenalOutrosOrgaos

------------------------------------------------------------------------------------------------------
-> FoiPenalizadoSTJ = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 LiqCorrente |        651    24.62353    203.8325     -65.24    4449.37
    LiqGeral |        651    21.23358    201.4794     -65.24    4449.37
 LiqCorAjust |        651    .4243464    .3639081    -3.6773          1
   SolvGeral |        651    29.01237    259.2962     -66.99    4449.37
    EndGeral |        651    1.153004    8.787333  -208.1876    34.6218
-------------+---------------------------------------------------------
 CompEndivid |        651    .7866369    .2649721          0          1
    IndepFin |        651    28.01713    259.2956   -67.9885   4448.367
    ImobilPL |        651    .1798339    3.824482   -95.5357     9.1728
   ImobRecNC |        651    .2199992    .2526778     -.1727     1.4904
 PtpCapTerce |        651    1.153004    8.787333  -208.1876    34.6218
-------------+---------------------------------------------------------
   GiroAtivo |        651    1.542487    1.900782     -.0289    32.9637
      MargOp |        651    .9889069    13.66699    -1.4199   348.9034
     MargLiq |        651    .1907648    2.535471   -14.1571    60.8893
         ROI |        651    .1614748    1.104968    -25.837     3.6612
         ROE |        651     .507284    2.980461    -3.6009    70.7696
-------------+---------------------------------------------------------
 vlrcontrato |        206    1.06e+07    2.08e+07      73284   8.19e+07
QtdeCNAEsS~s |        651    16.07834    15.09799          1         97
 IdadedeAnos |        651    22.42379    11.07274   .5041096   58.89315
QtePenalOu~s |        651    4.102919    19.68491          0        201

------------------------------------------------------------------------------------------------------
-> FoiPenalizadoSTJ = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 LiqCorrente |        280    10.15186    73.52903          0    1104.44
    LiqGeral |        280    9.810036    73.55928          0    1104.67
 LiqCorAjust |        280    .4118511    .3360704    -2.4927          1
   SolvGeral |        280    10.42664    73.82675          0    1109.62
    EndGeral |        280    1.042582    5.941962   -76.5962    20.4292
-------------+---------------------------------------------------------
 CompEndivid |        280    .7824754    .2312228          0          1
    IndepFin |        280    9.433916     73.8259     -.7622   1108.622
    ImobilPL |        280    .1528414    1.453138   -23.1117     3.2065
   ImobRecNC |        280    .1809746    .2495955     -.2471     1.4847
 PtpCapTerce |        280    1.042582    5.941962   -76.5962    20.4292
-------------+---------------------------------------------------------
   GiroAtivo |        280    1.624678    1.340864          0     6.2266
      MargOp |        280    .4894407    1.008674     -.1079    14.3886
     MargLiq |        280    .1270514     1.00757    -6.3956    12.4133
         ROI |        280    .1364761    .2644234    -1.1367     1.6018
         ROE |        280       .2849    .8948627    -3.9973    11.2697
-------------+---------------------------------------------------------
 vlrcontrato |        130    1.49e+07    3.07e+07   23769.99   1.34e+08
QtdeCNAEsS~s |        280    13.80714    12.16163          1         58
 IdadedeAnos |        280    23.16451    10.66048   3.482192   58.73151
QtePenalOu~s |        280       8.775      21.722          0        166


. 
. * Bloco para salvar as estat√≠sticas descritivas originais por grupo
. tabstat LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid IndepFin ImobilPL ImobRecNC 
> PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato QtdeCNAEsSecundarios IdadedeAnos QtePenalOu
> trosOrgaos, ///
>     statistics(mean sd min max n) by(FoiPenalizadoSTJ)

Summary statistics: Mean, SD, Min, Max, N
Group variable: FoiPenalizadoSTJ (FoiPenalizadoSTJ)

FoiPenalizadoSTJ |  LiqCor~e  LiqGeral  LiqCor~t  SolvGe~l  EndGeral  CompEn~d  IndepFin  ImobilPL
-----------------+--------------------------------------------------------------------------------
               0 |  24.62353  21.23358  .4243464  29.01237  1.153004  .7866369  28.01713  .1798339
                 |  203.8325  201.4794  .3639081  259.2962  8.787333  .2649721  259.2956  3.824482
                 |    -65.24    -65.24   -3.6773    -66.99 -208.1876         0  -67.9885  -95.5357
                 |   4449.37   4449.37         1   4449.37   34.6218         1  4448.367    9.1728
                 |       651       651       651       651       651       651       651       651
-----------------+--------------------------------------------------------------------------------
               1 |  10.15186  9.810036  .4118511  10.42664  1.042582  .7824754  9.433916  .1528414
                 |  73.52903  73.55928  .3360704  73.82675  5.941962  .2312228   73.8259  1.453138
                 |         0         0   -2.4927         0  -76.5962         0    -.7622  -23.1117
                 |   1104.44   1104.67         1   1109.62   20.4292         1  1108.622    3.2065
                 |       280       280       280       280       280       280       280       280
-----------------+--------------------------------------------------------------------------------
           Total |  20.27115  17.79793  .4205884  23.42267  1.119794  .7853853  22.42819  .1717159
                 |  175.2277  173.2711  .3556316  220.6801  8.035152  .2551754  220.6795  3.294931
                 |    -65.24    -65.24   -3.6773    -66.99 -208.1876         0  -67.9885  -95.5357
                 |   4449.37   4449.37         1   4449.37   34.6218         1  4448.367    9.1728
                 |       931       931       931       931       931       931       931       931
--------------------------------------------------------------------------------------------------

FoiPenalizadoSTJ |  ImobRe~C  PtpCap~e  GiroAt~o    MargOp   MargLiq       ROI       ROE  vlrcon~o
-----------------+--------------------------------------------------------------------------------
               0 |  .2199992  1.153004  1.542487  .9889069  .1907648  .1614748   .507284  1.06e+07
                 |  .2526778  8.787333  1.900782  13.66699  2.535471  1.104968  2.980461  2.08e+07
                 |    -.1727 -208.1876    -.0289   -1.4199  -14.1571   -25.837   -3.6009     73284
                 |    1.4904   34.6218   32.9637  348.9034   60.8893    3.6612   70.7696  8.19e+07
                 |       651       651       651       651       651       651       651       206
-----------------+--------------------------------------------------------------------------------
               1 |  .1809746  1.042582  1.624678  .4894407  .1270514  .1364761     .2849  1.49e+07
                 |  .2495955  5.941962  1.340864  1.008674   1.00757  .2644234  .8948627  3.07e+07
                 |    -.2471  -76.5962         0    -.1079   -6.3956   -1.1367   -3.9973  23769.99
                 |    1.4847   20.4292    6.2266   14.3886   12.4133    1.6018   11.2697  1.34e+08
                 |       280       280       280       280       280       280       280       130
-----------------+--------------------------------------------------------------------------------
           Total |  .2082625  1.119794  1.567206  .8386915  .1716029  .1539564  .4404016  1.23e+07
                 |   .252257  8.035152  1.750998  11.44148  2.190555  .9351267  2.541514  2.52e+07
                 |    -.2471 -208.1876    -.0289   -1.4199  -14.1571   -25.837   -3.9973  23769.99
                 |    1.4904   34.6218   32.9637  348.9034   60.8893    3.6612   70.7696  1.34e+08
                 |       931       931       931       931       931       931       931       336
--------------------------------------------------------------------------------------------------

FoiPenalizadoSTJ |  QtdeCN~s  Idaded~s  QtePen~s
-----------------+------------------------------
               0 |  16.07834  22.42379  4.102919
                 |  15.09799  11.07274  19.68491
                 |         1  .5041096         0
                 |        97  58.89315       201
                 |       651       651       651
-----------------+------------------------------
               1 |  13.80714  23.16451     8.775
                 |  12.16163  10.66048    21.722
                 |         1  3.482192         0
                 |        58  58.73151       166
                 |       280       280       280
-----------------+------------------------------
           Total |  15.39527  22.64656  5.508056
                 |  14.31003  10.94995  20.42007
                 |         1  .5041096         0
                 |        97  58.89315       201
                 |       931       931       931
------------------------------------------------

. 
. */*******************************************************************************
> 1.2 ‚Äì Winsoriza√ß√£o das vari√°veis cont√≠nuas (antes da imputa√ß√£o)
> *******************************************************************************/
. 
. ssc install winsor2, replace
checking winsor2 consistency and verifying not already installed...
all files already exist and are up to date.

. local winsor_vars LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid IndepFin ImobilPL 
> ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato

. 
. foreach var of local winsor_vars {
  2.     winsor2 `var', cuts(1 99) replace
  3. }

. 
. /*******************************************************************************
> 1.3 - Executar estat√≠sticas descritivas para todas as vari√°veis ap√≥s wisoriza√ß√£o
> *******************************************************************************/
. summarize LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid IndepFin ImobilPL ImobRecN
> C PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato QtdeCNAEsSecundarios IdadedeAnos QtePenal
> OutrosOrgaos

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 LiqCorrente |        931     11.2109     40.6634        .21     327.68
    LiqGeral |        931    7.981676    26.20506        .19      204.2
 LiqCorAjust |        931    .4298598    .2977401      -.518      .9979
   SolvGeral |        931    10.50537    38.22939        .34     327.68
    EndGeral |        931    1.372216    2.328307    -5.2517    13.0224
-------------+---------------------------------------------------------
 CompEndivid |        931    .7855506    .2546734      .0217          1
    IndepFin |        931    9.511547    38.22731     -.2514    326.675
    ImobilPL |        931    .2888404    .4358922     -.2471     2.8281
   ImobRecNC |        931    .2067792     .243615          0      .9662
 PtpCapTerce |        931    1.372216    2.328307    -5.2517    13.0224
-------------+---------------------------------------------------------
   GiroAtivo |        931    1.517332    1.306511          0     6.0238
      MargOp |        931    .4308339    .3388786     -.0351          1
     MargLiq |        931    .0973164    .3363066    -1.9653     1.0026
         ROI |        931     .178735     .325961     -.3632     1.9876
         ROE |        931    .3388057    .6602208    -1.1287     4.4129
-------------+---------------------------------------------------------
 vlrcontrato |        336    1.23e+07    2.52e+07      32820   1.34e+08
QtdeCNAEsS~s |        931    15.39527    14.31003          1         97
 IdadedeAnos |        931    22.64656    10.94995   .5041096   58.89315
QtePenalOu~s |        931    5.508056    20.42007          0        201

. 
. * Estat√≠sticas descritivas separadas por penaliza√ß√£o
. by FoiPenalizadoSTJ, sort: summarize LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid
>  IndepFin ImobilPL ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato QtdeCNAEsSecun
> darios IdadedeAnos QtePenalOutrosOrgaos

------------------------------------------------------------------------------------------------------
-> FoiPenalizadoSTJ = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 LiqCorrente |        651    13.15008    44.33276        .21     327.68
    LiqGeral |        651    9.058894    28.07785        .19      204.2
 LiqCorAjust |        651    .4344398     .300393      -.518      .9979
   SolvGeral |        651    12.03048    41.15147        .34     327.68
    EndGeral |        651    1.362274    2.294265    -5.2517    13.0224
-------------+---------------------------------------------------------
 CompEndivid |        651    .7868066     .264475      .0217          1
    IndepFin |        651    11.03625    41.14937     -.2514    326.675
    ImobilPL |        651    .3109705    .4539883     -.2471     2.8281
   ImobRecNC |        651    .2192498    .2475562          0      .9662
 PtpCapTerce |        651    1.362274    2.294265    -5.2517    13.0224
-------------+---------------------------------------------------------
   GiroAtivo |        651    1.471473    1.290879          0     6.0238
      MargOp |        651    .4372518    .3378751     -.0351          1
     MargLiq |        651    .1084555    .3322532    -1.9653     1.0026
         ROI |        651    .1949458    .3524576     -.3632     1.9876
         ROE |        651    .3634088    .6923151    -1.1287     4.4129
-------------+---------------------------------------------------------
 vlrcontrato |        206    1.06e+07    2.08e+07      73284   8.19e+07
QtdeCNAEsS~s |        651    16.07834    15.09799          1         97
 IdadedeAnos |        651    22.42379    11.07274   .5041096   58.89315
QtePenalOu~s |        651    4.102919    19.68491          0        201

------------------------------------------------------------------------------------------------------
-> FoiPenalizadoSTJ = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 LiqCorrente |        280    6.702321    30.06092        .21     327.68
    LiqGeral |        280    5.477143    21.05516        .19      204.2
 LiqCorAjust |        280    .4192114    .2917316      -.518      .9979
   SolvGeral |        280      6.9595    30.13764        .34     327.68
    EndGeral |        280    1.395331    2.409623    -5.2517    13.0224
-------------+---------------------------------------------------------
 CompEndivid |        280    .7826304     .230703      .0217          1
    IndepFin |        280    5.966618    30.13568     -.2514    326.675
    ImobilPL |        280    .2373879    .3864801     -.2471     2.8281
   ImobRecNC |        280     .177785    .2320442          0      .9662
 PtpCapTerce |        280    1.395331    2.409623    -5.2517    13.0224
-------------+---------------------------------------------------------
   GiroAtivo |        280    1.623954    1.338422          0     6.0238
      MargOp |        280    .4159125      .34134     -.0351          1
     MargLiq |        280    .0714182    .3447585    -1.9653     1.0026
         ROI |        280     .141045    .2504266     -.3632     1.6018
         ROE |        280    .2816036      .57587    -1.1287     4.4129
-------------+---------------------------------------------------------
 vlrcontrato |        130    1.49e+07    3.07e+07      32820   1.34e+08
QtdeCNAEsS~s |        280    13.80714    12.16163          1         58
 IdadedeAnos |        280    23.16451    10.66048   3.482192   58.73151
QtePenalOu~s |        280       8.775      21.722          0        166


. 
. * Bloco para salvar as estat√≠sticas descritivas ap√≥s a winsoriza√ß√£o por grupo
. tabstat LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid IndepFin ImobilPL ImobRecNC 
> PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE vlrcontrato QtdeCNAEsSecundarios IdadedeAnos QtePenalOu
> trosOrgaos, ///
>     statistics(mean sd min max n) by(FoiPenalizadoSTJ)

Summary statistics: Mean, SD, Min, Max, N
Group variable: FoiPenalizadoSTJ (FoiPenalizadoSTJ)

FoiPenalizadoSTJ |  LiqCor~e  LiqGeral  LiqCor~t  SolvGe~l  EndGeral  CompEn~d  IndepFin  ImobilPL
-----------------+--------------------------------------------------------------------------------
               0 |  13.15008  9.058894  .4344398  12.03048  1.362274  .7868066  11.03625  .3109705
                 |  44.33276  28.07785   .300393  41.15147  2.294265   .264475  41.14937  .4539883
                 |       .21       .19     -.518       .34   -5.2517     .0217    -.2514    -.2471
                 |    327.68     204.2     .9979    327.68   13.0224         1   326.675    2.8281
                 |       651       651       651       651       651       651       651       651
-----------------+--------------------------------------------------------------------------------
               1 |  6.702321  5.477143  .4192114    6.9595  1.395331  .7826304  5.966618  .2373879
                 |  30.06092  21.05516  .2917316  30.13764  2.409623   .230703  30.13568  .3864801
                 |       .21       .19     -.518       .34   -5.2517     .0217    -.2514    -.2471
                 |    327.68     204.2     .9979    327.68   13.0224         1   326.675    2.8281
                 |       280       280       280       280       280       280       280       280
-----------------+--------------------------------------------------------------------------------
           Total |   11.2109  7.981676  .4298598  10.50537  1.372216  .7855506  9.511547  .2888404
                 |   40.6634  26.20506  .2977401  38.22939  2.328307  .2546734  38.22731  .4358922
                 |       .21       .19     -.518       .34   -5.2517     .0217    -.2514    -.2471
                 |    327.68     204.2     .9979    327.68   13.0224         1   326.675    2.8281
                 |       931       931       931       931       931       931       931       931
--------------------------------------------------------------------------------------------------

FoiPenalizadoSTJ |  ImobRe~C  PtpCap~e  GiroAt~o    MargOp   MargLiq       ROI       ROE  vlrcon~o
-----------------+--------------------------------------------------------------------------------
               0 |  .2192498  1.362274  1.471473  .4372518  .1084555  .1949458  .3634088  1.06e+07
                 |  .2475562  2.294265  1.290879  .3378751  .3322532  .3524576  .6923151  2.08e+07
                 |         0   -5.2517         0    -.0351   -1.9653    -.3632   -1.1287     73284
                 |     .9662   13.0224    6.0238         1    1.0026    1.9876    4.4129  8.19e+07
                 |       651       651       651       651       651       651       651       206
-----------------+--------------------------------------------------------------------------------
               1 |   .177785  1.395331  1.623954  .4159125  .0714182   .141045  .2816036  1.49e+07
                 |  .2320442  2.409623  1.338422    .34134  .3447585  .2504266    .57587  3.07e+07
                 |         0   -5.2517         0    -.0351   -1.9653    -.3632   -1.1287     32820
                 |     .9662   13.0224    6.0238         1    1.0026    1.6018    4.4129  1.34e+08
                 |       280       280       280       280       280       280       280       130
-----------------+--------------------------------------------------------------------------------
           Total |  .2067792  1.372216  1.517332  .4308339  .0973164   .178735  .3388057  1.23e+07
                 |   .243615  2.328307  1.306511  .3388786  .3363066   .325961  .6602208  2.52e+07
                 |         0   -5.2517         0    -.0351   -1.9653    -.3632   -1.1287     32820
                 |     .9662   13.0224    6.0238         1    1.0026    1.9876    4.4129  1.34e+08
                 |       931       931       931       931       931       931       931       336
--------------------------------------------------------------------------------------------------

FoiPenalizadoSTJ |  QtdeCN~s  Idaded~s  QtePen~s
-----------------+------------------------------
               0 |  16.07834  22.42379  4.102919
                 |  15.09799  11.07274  19.68491
                 |         1  .5041096         0
                 |        97  58.89315       201
                 |       651       651       651
-----------------+------------------------------
               1 |  13.80714  23.16451     8.775
                 |  12.16163  10.66048    21.722
                 |         1  3.482192         0
                 |        58  58.73151       166
                 |       280       280       280
-----------------+------------------------------
           Total |  15.39527  22.64656  5.508056
                 |  14.31003  10.94995  20.42007
                 |         1  .5041096         0
                 |        97  58.89315       201
                 |       931       931       931
------------------------------------------------

. 
. /*******************************************************************************
> 1.4 - Transforma√ß√£o de vari√°veis 
> *******************************************************************************/
. * N√ÉO gerar dummies ainda ‚Äî manter Porte, CNAE e NaturezaJuridica para o SMOTENC
. 
. * Ajuste apenas valores de vari√°veis cont√≠nuas
. replace vlrcontrato = 1 if vlrcontrato == 0 | vlrcontrato == .
(595 real changes made)

. gen log_vlrcontrato = log(vlrcontrato)

. 
. * Dropar CNPJ antes de exportar
. drop CNPJ

. 
. 
. /*******************************************************************************
> ETAPA 2 - IMPUTA√á√ÉO DOS VALORES FALTANTES (MISSING) COM M√âDIA OU MEDIANA
> *******************************************************************************/
. 
. * Lista de vari√°veis com dados faltantes para imputa√ß√£o
. local imput_vars GiroAtivo MargOp MargLiq ROI ROE RecBruta LucroBruto LucroLiquido

. 
. * Inicializar contadores
. local conta_media = 0

. local conta_mediana = 0

. 
. * Imputa√ß√£o adaptativa: m√©dia se CV <= 0.3, mediana se CV > 0.3
. foreach var of local imput_vars {
  2.     
.     quietly summarize `var' if `var' > 0, detail
  3.     local media = r(mean)
  4.     local desvio = r(sd)
  5.     local mediana = r(p50)
  6. 
.     * Calcular o Coeficiente de Varia√ß√£o (CV)
.     local cv = `desvio' / `media'
  7. 
.     * Escolher m√©todo conforme o CV
.     if `cv' <= 0.3 {
  8.         replace `var' = `media' if missing(`var') | `var' == 0
  9.         local conta_media = `conta_media' + 1
 10.         di as result "üîß `var': imputado com M√âDIA (CV = " %4.3f `cv' ")"
 11.     }
 12.     else {
 13.         replace `var' = `mediana' if missing(`var') | `var' == 0
 14.         local conta_mediana = `conta_mediana' + 1
 15.         di as result "üîß `var': imputado com MEDIANA (CV = " %4.3f `cv' ")"
 16.     }
 17. }
(98 real changes made)
üîß GiroAtivo: imputado com MEDIANA (CV = 0.747)
(137 real changes made)
üîß MargOp: imputado com MEDIANA (CV = 0.597)
(100 real changes made)
üîß MargLiq: imputado com MEDIANA (CV = 1.172)
(80 real changes made)
üîß ROI: imputado com MEDIANA (CV = 1.366)
(80 real changes made)
üîß ROE: imputado com MEDIANA (CV = 1.442)
(97 real changes made)
üîß RecBruta: imputado com MEDIANA (CV = 6.666)
(127 real changes made)
üîß LucroBruto: imputado com MEDIANA (CV = 7.204)
(79 real changes made)
üîß LucroLiquido: imputado com MEDIANA (CV = 7.812)

. 
. * Exibir tabela resumo
. di as text "‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê"
‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê

. di as text " Resumo da Imputa√ß√£o de Vari√°veis (Crit√©rio: CV <= 0.3 ‚Üí M√âDIA)"
 Resumo da Imputa√ß√£o de Vari√°veis (Crit√©rio: CV <= 0.3 ‚Üí M√âDIA)

. di as text "‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ"
‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ

. di " Vari√°veis imputadas com M√âDIA:   `conta_media'"
 Vari√°veis imputadas com M√âDIA:   0

. di " Vari√°veis imputadas com MEDIANA: `conta_mediana'"
 Vari√°veis imputadas com MEDIANA: 8

. di as text " Total de vari√°veis imputadas:    " `=`conta_media' + `conta_mediana''
 Total de vari√°veis imputadas:    8

. di as text "‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê"
‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê

. 
. 
. /*******************************************************************************
> ETAPA 3 - SEPARA√á√ÉO DOS DADOS EM CONJUNTOS DE TREINAMENTO E TESTE COM PROPOR√á√ïES EXATAS
> *******************************************************************************/
. * Definir uma seed para reprodutibilidade
. set seed 12345

. 
. * Gerar uma vari√°vel aleat√≥ria uniforme entre 0 e 1
. generate u = runiform()

. 
. * Ordenar aleatoriamente dentro de cada classe
. sort FoiPenalizadoSTJ u

. 
. * Gerar √≠ndices de observa√ß√£o dentro de cada classe
. by FoiPenalizadoSTJ: gen obs_no = _n

. by FoiPenalizadoSTJ: gen total_obs = _N

. 
. * Calcular o ponto de corte para 80% das observa√ß√µes
. by FoiPenalizadoSTJ: gen cutoff = ceil(0.80 * total_obs)

. 
. * Criar o indicador de treinamento
. gen train = 0

. replace train = 1 if obs_no <= cutoff
(745 real changes made)

. 
. * Verificar distribui√ß√£o antes do SMOTE
. tabulate FoiPenalizadoSTJ train

FoiPenaliz |         train
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       130        521 |       651 
         1 |        56        224 |       280 
-----------+----------------------+----------
     Total |       186        745 |       931 

. 
. /*******************************************************************************
> ETAPA 3.1 - SALVAR OS LABELS PARA RESTAURAR DEPOIS DO SMOTE
> *******************************************************************************/
. * Criar um arquivo tempor√°rio para armazenar labels
. tempfile labels_backup

. label save using "`labels_backup'.do", replace
(file C:\Users\morenos\AppData\Local\Temp\ST_3f4c_000001.tmp.do not found)
file C:\Users\morenos\AppData\Local\Temp\ST_3f4c_000001.tmp.do saved

. 
. /*******************************************************************************
> ETAPA 3.2 - EXPORTAR BASES PARA O PYTHON (TREINO PARA SMOTE, TESTE SEPARADO)
> *******************************************************************************/
. * Exportar conjunto de treino
. preserve

. keep if train == 1
(186 observations deleted)

. export delimited using "train_data.csv", replace
file train_data.csv saved

. restore

. 
. * Exportar conjunto de teste
. preserve

. keep if train == 0
(745 observations deleted)

. export delimited using "test_data.csv", replace
file test_data.csv saved

. restore

. 
. /*******************************************************************************
> ETAPA 4 - APLICAR SMOTENC NO PYTHON
> *******************************************************************************/
. python:
----------------------------------------------- python (type end to exit) ----------------------------
>>> import pandas as pd
>>> import numpy as np
>>> from imblearn.over_sampling import SMOTENC
>>> import traceback  # Para melhor tratamento de erros
>>> 
>>> print("--- Iniciando Bloco Python ---")
--- Iniciando Bloco Python ---
>>> try:
...     # Carregar conjunto de treino do Stata
...     print("Carregando train_data.csv...")
...     df = pd.read_csv("train_data.csv")
...     print(f"Dados carregados: {df.shape[0]} linhas, {df.shape[1]} colunas")
...     print("Colunas originais:", df.columns.tolist())
...     print("Contagem inicial de 'FoiPenalizadoSTJ':\n", df["FoiPenalizadoSTJ"].value_counts())
... 
...     # Separar vari√°vel-alvo e explicativas
...     X = df.drop(columns=["FoiPenalizadoSTJ", "train"], errors="ignore")
...     y = df["FoiPenalizadoSTJ"]
... 
...     # Definir vari√°veis categ√≥ricas PELOS NOMES (mais robusto)
...     categorical_feature_names = ['Porte', 'CNAE', 'DivisaoCNAE', 'NaturezaJuridica']
... 
...     # Verificar se as colunas existem em X
...     missing_cols = [col for col in categorical_feature_names if col not in X.columns]
...     if missing_cols:
...         raise ValueError(f"As seguintes colunas categ√≥ricas n√£o foram encontradas em X: {missing_c
> ols}")
... 
...     # Obter os √≠ndices das colunas categ√≥ricas
...     categorical_features_indices = [X.columns.get_loc(col) for col in categorical_feature_names]
...     print(f"√çndices das features categ√≥ricas: {categorical_features_indices}")
...     print("Tipos das features categ√≥ricas em X:\n", X[categorical_feature_names].dtypes)
... 
...     # Ajustar k_neighbors: deve ser menor que o n√∫mero de amostras da classe minorit√°ria
...     min_class_count = y.value_counts().min()
...     k_neighbors_val = min(5, min_class_count - 1)
...     if k_neighbors_val < 1:
...         print(f"AVISO: Classe minorit√°ria tem apenas {min_class_count} amostras. N√£o √© poss√≠vel ap
> licar SMOTENC com k_neighbors >= 1.")
...         raise ValueError(f"N√£o √© poss√≠vel aplicar SMOTENC, k_neighbors ({k_neighbors_val}) seria m
> enor que 1.")
...     else:
...         print(f"Aplicando SMOTENC com k_neighbors={k_neighbors_val}...")
...         smote_nc = SMOTENC(categorical_features=categorical_features_indices,
...                            random_state=42,
...                            k_neighbors=k_neighbors_val)
... 
...         X_resampled, y_resampled = smote_nc.fit_resample(X, y)
...         print("SMOTENC conclu√≠do.")
...         print(f"Tamanho ap√≥s resample: {X_resampled.shape[0]} linhas")
...         print("Contagem de 'FoiPenalizadoSTJ' ap√≥s resample:\n", pd.Series(y_resampled).value_coun
> ts())
... 
...         # Criar DataFrame balanceado a partir do resultado do SMOTENC
...         df_resampled = pd.DataFrame(X_resampled, columns=X.columns)
... 
...         # Adicionar a vari√°vel alvo e a marca√ß√£o de treino
...         df_resampled["FoiPenalizadoSTJ"] = y_resampled
...         df_resampled["train"] = 1
... 
...         # Verificar se as colunas categ√≥ricas foram mantidas
...         print("Colunas no df_resampled final:", df_resampled.columns.tolist())
...         missing_cols_after = [col for col in categorical_feature_names if col not in df_resampled.
> columns]
...         if missing_cols_after:
...             print(f"AVISO: As colunas {missing_cols_after} N√ÉO est√£o presentes ap√≥s SMOTENC!")
...         else:
...             print("Colunas categ√≥ricas presentes ap√≥s SMOTENC.")
...             print("Tipos das features categ√≥ricas ap√≥s SMOTENC:\n", df_resampled[categorical_featu
> re_names].dtypes)
...             print("Primeiras linhas do df_resampled:\n", df_resampled.head())
... 
...         # üîÅ Converter vari√°veis categ√≥ricas e salvar mapeamentos
...         print("Convertendo vari√°veis categ√≥ricas do treino para c√≥digos num√©ricos e salvando mapea
> mentos...")
... 
...         categorical_mappings = {}
... 
...         for col in categorical_feature_names:
...             df_resampled[col] = df_resampled[col].astype("category")
... 
...             # Salvar mapeamento antes de converter para c√≥digos
...             mapping = dict(enumerate(df_resampled[col].cat.categories))
...             categorical_mappings[col] = mapping
... 
...             # Substituir coluna por c√≥digos num√©ricos
...             df_resampled[col] = df_resampled[col].cat.codes
... 
...             # Exportar mapeamento para CSV
...             mapping_df = pd.DataFrame(mapping.items(), columns=[f"{col}_code", f"{col}_label"])
...             mapping_df.to_csv(f"{col}_mapping.csv", index=False, encoding="utf-8")
...             print(f"‚úÖ Mapeamento salvo: {col}_mapping.csv")
... 
...         print("Convers√£o no treino conclu√≠da.")
... 
...     # Salvar dataset balanceado em CSV (codificado em UTF-8)
...     print("Salvando train_data_balanced.csv...")
...     df_resampled.to_csv("train_data_balanced.csv", index=False, encoding='utf-8')
...     print("Arquivo train_data_balanced.csv salvo com sucesso.")
... 
...     # ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ
...     # ‚úÖ ETAPA EXTRA: Converter vari√°veis categ√≥ricas do conjunto de teste com os mesmos c√≥digos do
>  treino
...     print("Carregando test_data.csv para convers√£o das vari√°veis categ√≥ricas...")
...     df_test = pd.read_csv("test_data.csv")
...     print(f"Conjunto de teste carregado: {df_test.shape[0]} linhas")
... 
...     # Verificar se as colunas categ√≥ricas est√£o presentes
...     missing_test_cols = [col for col in categorical_feature_names if col not in df_test.columns]
...     if missing_test_cols:
...         raise ValueError(f"‚ö†Ô∏è Colunas categ√≥ricas ausentes no teste: {missing_test_cols}")
... 
...     print("Aplicando os mesmos mapeamentos do treino ao conjunto de teste...")
... 
...     for col in categorical_feature_names:
...         mapping_df = pd.read_csv(f"{col}_mapping.csv", encoding="utf-8")
...         mapping_dict = dict(zip(mapping_df[f"{col}_label"], mapping_df[f"{col}_code"]))
... 
...         # Aplicar o mapeamento manualmente
...         df_test[col] = df_test[col].map(mapping_dict)
... 
...         # Se houver valores n√£o encontrados no mapeamento, definir como -1
...         df_test[col] = df_test[col].fillna(-1).astype(int)
... 
...         print(f"‚úÖ Coluna '{col}' convertida com mapeamento do treino.")
... 
...     # Salvar novamente o arquivo convertido
...     df_test.to_csv("test_data.csv", index=False, encoding="utf-8")
...     print("Arquivo test_data.csv salvo com sucesso ap√≥s convers√£o.")
... 
... except Exception as e:
...     print("--- ERRO NO BLOCO PYTHON ---")
...     print(traceback.format_exc())
...     pd.DataFrame().to_csv("train_data_balanced.csv", index=False)
...     print("Arquivo train_data_balanced.csv vazio criado devido a erro.")
... 
Carregando train_data.csv...
Dados carregados: 745 linhas, 42 colunas
Colunas originais: ['FoiPenalizadoSTJ', 'Porte', 'LiqCorrente', 'LiqGeral', 'LiqCorAjust', 'SolvGeral'
> , 'EndGeral', 'CompEndivid', 'IndepFin', 'ImobilPL', 'ImobRecNC', 'PtpCapTerce', 'GiroAtivo', 'MargO
> p', 'MargLiq', 'ROI', 'ROE', 'AC', 'ANRP', 'Investimentos', 'Imobilizado', 'Intangivel', 'PC', 'PNC'
> , 'PL', 'RecBruta', 'LucroBruto', 'LucroLiquido', 'QtePenalOutrosOrgaos', 'vlrcontrato', 'IdadedeAno
> s', 'CNAE', 'DivisaoCNAE', 'NaturezaJuridica', 'QtdeCNAEsSecundarios', 'AnodasDemonstrac√µes', 'log_v
> lrcontrato', 'u', 'obs_no', 'total_obs', 'cutoff', 'train']
Contagem inicial de 'FoiPenalizadoSTJ':
 FoiPenalizadoSTJ
0    521
1    224
Name: count, dtype: int64
√çndices das features categ√≥ricas: [0, 30, 31, 32]
Tipos das features categ√≥ricas em X:
 Porte               object
CNAE                object
DivisaoCNAE          int64
NaturezaJuridica    object
dtype: object
Aplicando SMOTENC com k_neighbors=5...
SMOTENC conclu√≠do.
Tamanho ap√≥s resample: 1042 linhas
Contagem de 'FoiPenalizadoSTJ' ap√≥s resample:
 FoiPenalizadoSTJ
0    521
1    521
Name: count, dtype: int64
Colunas no df_resampled final: ['Porte', 'LiqCorrente', 'LiqGeral', 'LiqCorAjust', 'SolvGeral', 'EndGe
> ral', 'CompEndivid', 'IndepFin', 'ImobilPL', 'ImobRecNC', 'PtpCapTerce', 'GiroAtivo', 'MargOp', 'Mar
> gLiq', 'ROI', 'ROE', 'AC', 'ANRP', 'Investimentos', 'Imobilizado', 'Intangivel', 'PC', 'PNC', 'PL', 
> 'RecBruta', 'LucroBruto', 'LucroLiquido', 'QtePenalOutrosOrgaos', 'vlrcontrato', 'IdadedeAnos', 'CNA
> E', 'DivisaoCNAE', 'NaturezaJuridica', 'QtdeCNAEsSecundarios', 'AnodasDemonstrac√µes', 'log_vlrcontra
> to', 'u', 'obs_no', 'total_obs', 'cutoff', 'FoiPenalizadoSTJ', 'train']
Colunas categ√≥ricas presentes ap√≥s SMOTENC.
Tipos das features categ√≥ricas ap√≥s SMOTENC:
 Porte               object
CNAE                object
DivisaoCNAE          int64
NaturezaJuridica    object
dtype: object
Primeiras linhas do df_resampled:
                      Porte  LiqCorrente  ...  FoiPenalizadoSTJ  train
0          PEQUENA EMPRESA         1.21  ...                 0      1
1   EMPRESA DE M√âDIO PORTE         1.23  ...                 0      1
2          PEQUENA EMPRESA         3.62  ...                 0      1
3  EMPRESA DE GRANDE PORTE         0.70  ...                 0      1
4  EMPRESA DE GRANDE PORTE         0.76  ...                 0      1

[5 rows x 42 columns]
Convertendo vari√°veis categ√≥ricas do treino para c√≥digos num√©ricos e salvando mapeamentos...
‚úÖ Mapeamento salvo: Porte_mapping.csv
‚úÖ Mapeamento salvo: CNAE_mapping.csv
‚úÖ Mapeamento salvo: DivisaoCNAE_mapping.csv
‚úÖ Mapeamento salvo: NaturezaJuridica_mapping.csv
Convers√£o no treino conclu√≠da.
Salvando train_data_balanced.csv...
Arquivo train_data_balanced.csv salvo com sucesso.
Carregando test_data.csv para convers√£o das vari√°veis categ√≥ricas...
Conjunto de teste carregado: 186 linhas
Aplicando os mesmos mapeamentos do treino ao conjunto de teste...
‚úÖ Coluna 'Porte' convertida com mapeamento do treino.
‚úÖ Coluna 'CNAE' convertida com mapeamento do treino.
‚úÖ Coluna 'DivisaoCNAE' convertida com mapeamento do treino.
‚úÖ Coluna 'NaturezaJuridica' convertida com mapeamento do treino.
Arquivo test_data.csv salvo com sucesso ap√≥s convers√£o.
>>> print("--- Fim Bloco Python ---")
--- Fim Bloco Python ---
>>> end
------------------------------------------------------------------------------------------------------

. 
. 
. /*******************************************************************************
> ETAPA 5 - IMPORTAR NOVO CONJUNTO DE TREINO BALANCEADO NO STATA
> *******************************************************************************/
. clear

. * Adicionado varnames(1) e case(preserve)
. import delimited "train_data_balanced.csv", varnames(1) case(preserve) clear encoding("UTF-8")
(42 vars, 1,042 obs)

. 
. * Verificar se as vari√°veis existem ap√≥s a importa√ß√£o
. describe Porte CNAE DivisaoCNAE NaturezaJuridica 

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------
Porte           byte    %8.0g                 
CNAE            int     %8.0g                 
DivisaoCNAE     byte    %8.0g                 
NaturezaJurid~a byte    %8.0g                 

. 
. * Restaurar labels originais corretamente
. * Certifique-se que os labels ainda s√£o aplic√°veis. SMOTE pode alterar a natureza dos dados.
. * Considere recriar labels se necess√°rio, ou pular esta etapa se causar problemas.
. capture do "`labels_backup'.do"

. 
. if _rc != 0 {
.     di as error "‚ö†Ô∏è Falha ao restaurar labels. Verificar compatibilidade ap√≥s SMOTE."
. }

. else {
.     di as text "‚úÖ Labels restaurados com sucesso ap√≥s SMOTE."
‚úÖ Labels restaurados com sucesso ap√≥s SMOTE.
. }

. 
. * Verificar balanceamento do conjunto de treino
. tabulate FoiPenalizadoSTJ train

FoiPenaliz |   train
    adoSTJ |         1 |     Total
-----------+-----------+----------
         0 |       521 |       521 
         1 |       521 |       521 
-----------+-----------+----------
     Total |     1,042 |     1,042 

. 
. /*******************************************************************************
> ETAPA 5.1 ‚Äì IMPORTAR CONJUNTO DE TESTE E JUNTAR √Ä BASE DE TREINO BALANCEADO
> *******************************************************************************/
. * Passo 1 ‚Äì Importar o conjunto de teste separadamente e salvar como tempor√°rio
. clear

. * Adicionado case(preserve)
. import delimited "test_data.csv", varnames(1) case(preserve) encoding("UTF-8")
(42 vars, 186 obs)

. tempfile testdata

. save `testdata', replace // Adicionado replace para seguran√ßa
(file C:\Users\morenos\AppData\Local\Temp\ST_3f4c_000004.tmp not found)
file C:\Users\morenos\AppData\Local\Temp\ST_3f4c_000004.tmp saved as .dta format

. 
. * Passo 2 ‚Äì Agora importar o treino balanceado
. clear

. * Adicionado varnames(1) e case(preserve)
. import delimited "train_data_balanced.csv", varnames(1) case(preserve) clear encoding("UTF-8")
(42 vars, 1,042 obs)

. 
. * Passo 3 ‚Äì Restaurar os labels originais (novamente, verificar necessidade/compatibilidade)
. capture do "`labels_backup'.do"

. if _rc != 0 {
.     di as error "Falha ao restaurar labels. Verificar compatibilidade ap√≥s SMOTE."
. }

. 
. * Passo 4 ‚Äì Juntar com o conjunto de teste
. * Verificar se as vari√°veis categ√≥ricas existem antes de juntar
. describe Porte CNAE DivisaoCNAE NaturezaJuridica

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------
Porte           byte    %8.0g                 
CNAE            int     %8.0g                 
DivisaoCNAE     byte    %8.0g                 
NaturezaJurid~a byte    %8.0g                 

. append using `testdata'

. 
. * Passo 5 ‚Äì Verificar a distribui√ß√£o final por treino/teste
. tabulate FoiPenalizadoSTJ train

FoiPenaliz |         train
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       130        521 |       651 
         1 |        56        521 |       577 
-----------+----------------------+----------
     Total |       186      1,042 |     1,228 

. 
. * Verificar se as vari√°veis existem ap√≥s o append
. describe Porte CNAE DivisaoCNAE NaturezaJuridica

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------
Porte           byte    %8.0g                 
CNAE            int     %8.0g                 
DivisaoCNAE     byte    %8.0g                 
NaturezaJurid~a byte    %8.0g                 

. 
. /*******************************************************************************
> ETAPA 5.1.1 ‚Äì AGRUPAMENTO DE CNAEs RAROS (CATEGORIAS COM POUCA FREQU√äNCIA)
> *******************************************************************************/
. 
. * Define o m√≠nimo de ocorr√™ncias para manter CNAE como categoria isolada
. local freq_minima = 10

. 
. * Cria um grupo especial para CNAEs com baixa frequ√™ncia
. preserve

. 
. * Guardar vers√£o original, caso queira rastrear depois
. gen CNAE_original = CNAE 

. 
. * Gerar mapa de frequ√™ncia dos CNAEs
. contract CNAE

. gen CNAE_agrupado = CNAE

. replace CNAE_agrupado = -1 if _freq < `freq_minima'
(75 real changes made)

. tempfile freqmap

. save `freqmap', replace
(file C:\Users\morenos\AppData\Local\Temp\ST_3f4c_000006.tmp not found)
file C:\Users\morenos\AppData\Local\Temp\ST_3f4c_000006.tmp saved as .dta format

. 
. restore

. 
. * Aplicar o agrupamento via merge (sem 'nogen' para capturar _merge)
. merge m:1 CNAE using `freqmap', keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             1,228  (_merge==3)
    -----------------------------------------

. 
. * Substituir CNAE por CNAE_agrupado apenas onde houver correspond√™ncia
. replace CNAE = CNAE_agrupado if _merge == 3
(260 real changes made)

. drop _merge CNAE_agrupado _freq

. 
. * Verifica distribui√ß√£o ap√≥s o agrupamento
. tabulate CNAE

       CNAE |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |        263       21.42       21.42
          4 |         10        0.81       22.23
         10 |         62        5.05       27.28
         13 |         11        0.90       28.18
         14 |         69        5.62       33.79
         16 |         11        0.90       34.69
         18 |         21        1.71       36.40
         19 |         23        1.87       38.27
         21 |         17        1.38       39.66
         31 |         18        1.47       41.12
         34 |         20        1.63       42.75
         36 |         51        4.15       46.91
         37 |         28        2.28       49.19
         46 |         16        1.30       50.49
         48 |         59        4.80       55.29
         51 |         11        0.90       56.19
         60 |         11        0.90       57.08
         61 |         10        0.81       57.90
         65 |         31        2.52       60.42
         66 |         15        1.22       61.64
         67 |         25        2.04       63.68
         68 |         51        4.15       67.83
         69 |        102        8.31       76.14
         72 |         12        0.98       77.12
         73 |         13        1.06       78.18
         74 |         11        0.90       79.07
         77 |         25        2.04       81.11
         82 |         13        1.06       82.17
         83 |         11        0.90       83.06
         88 |         53        4.32       87.38
         89 |         20        1.63       89.01
         90 |         29        2.36       91.37
         91 |         25        2.04       93.40
         94 |         15        1.22       94.63
         95 |         25        2.04       96.66
         96 |         20        1.63       98.29
         97 |         11        0.90       99.19
        101 |         10        0.81      100.00
------------+-----------------------------------
      Total |      1,228      100.00

. di as text "‚úÖ Agrupamento de CNAEs raros conclu√≠do com base na frequ√™ncia m√≠nima de `freq_minima'."
‚úÖ Agrupamento de CNAEs raros conclu√≠do com base na frequ√™ncia m√≠nima de 10.

. 
. 
. /*******************************************************************************
> ETAPA 5.2 ‚Äì CONVERTER VARI√ÅVEIS CATEG√ìRICAS PARA INTEIROS E GERAR DUMMIES (ap√≥s SMOTENC)
> *******************************************************************************/
. * Arredondar valores para garantir categorias inteiras
. * Isso pode ser necess√°rio se o Python/SMOTE as transformou em float, mas idealmente n√£o deveria.
. * Adicione verifica√ß√µes para evitar erros se a vari√°vel n√£o existir (embora agora deva existir)
. 
. capture confirm variable Porte

. if _rc == 0 {
.     replace Porte = round(Porte)
(0 real changes made)
. } 

. else {
.     di as error "Vari√°vel Porte ainda n√£o encontrada antes do round!"
. }

. 
. capture confirm variable CNAE

. if _rc == 0 {
.     replace CNAE = round(CNAE)
(0 real changes made)
. } 

. else {
.     di as error "Vari√°vel CNAE n√£o encontrada antes do round!"
. }

. 
. capture confirm variable NaturezaJuridica

. if _rc == 0 {
.     replace NaturezaJuridica = round(NaturezaJuridica)
(0 real changes made)
. } 

. else {
.     di as error "Vari√°vel NaturezaJuridica n√£o encontrada antes do round!"
. }

. 
. 
. capture confirm variable DivisaoCNAE

. if _rc == 0 {
.     replace DivisaoCNAE = round(DivisaoCNAE)
(0 real changes made)
. } 

. else {
.     di as error "Vari√°vel DivisaoCNAE n√£o encontrada antes do round!"
. }

. 
. * Gerar vari√°veis dummies
. * Adicione verifica√ß√µes aqui tamb√©m
. capture confirm variable Porte

. if _rc == 0 {
.     tabulate Porte, generate(Porte_)

      Porte |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        138       11.24       11.24
          1 |        197       16.04       27.28
          2 |        137       11.16       38.44
          3 |        756       61.56      100.00
------------+-----------------------------------
      Total |      1,228      100.00
.     drop Porte // Dropar original apenas se as dummies foram criadas
. } 

. else {
.      di as error "N√£o foi poss√≠vel gerar dummies para Porte."
. }

. 
. capture confirm variable CNAE

. if _rc == 0 {
.     tabulate CNAE, generate(CNAE_)

       CNAE |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |        263       21.42       21.42
          4 |         10        0.81       22.23
         10 |         62        5.05       27.28
         13 |         11        0.90       28.18
         14 |         69        5.62       33.79
         16 |         11        0.90       34.69
         18 |         21        1.71       36.40
         19 |         23        1.87       38.27
         21 |         17        1.38       39.66
         31 |         18        1.47       41.12
         34 |         20        1.63       42.75
         36 |         51        4.15       46.91
         37 |         28        2.28       49.19
         46 |         16        1.30       50.49
         48 |         59        4.80       55.29
         51 |         11        0.90       56.19
         60 |         11        0.90       57.08
         61 |         10        0.81       57.90
         65 |         31        2.52       60.42
         66 |         15        1.22       61.64
         67 |         25        2.04       63.68
         68 |         51        4.15       67.83
         69 |        102        8.31       76.14
         72 |         12        0.98       77.12
         73 |         13        1.06       78.18
         74 |         11        0.90       79.07
         77 |         25        2.04       81.11
         82 |         13        1.06       82.17
         83 |         11        0.90       83.06
         88 |         53        4.32       87.38
         89 |         20        1.63       89.01
         90 |         29        2.36       91.37
         91 |         25        2.04       93.40
         94 |         15        1.22       94.63
         95 |         25        2.04       96.66
         96 |         20        1.63       98.29
         97 |         11        0.90       99.19
        101 |         10        0.81      100.00
------------+-----------------------------------
      Total |      1,228      100.00
.     drop CNAE
. } 

. else {
.      di as error "N√£o foi poss√≠vel gerar dummies para CNAE."
. }

. 
. capture confirm variable DivisaoCNAE

. if _rc == 0 {
.     tabulate DivisaoCNAE, generate(DivisaoCNAE_)

DivisaoCNAE |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |          1        0.08        0.08
          0 |          3        0.24        0.33
          1 |          2        0.16        0.49
          2 |          5        0.41        0.90
          3 |         11        0.90        1.79
          4 |          7        0.57        2.36
          5 |          3        0.24        2.61
          6 |         56        4.56        7.17
          7 |         16        1.30        8.47
          8 |         69        5.62       14.09
          9 |         21        1.71       15.80
         10 |         78        6.35       22.15
         11 |          6        0.49       22.64
         12 |        152       12.38       35.02
         13 |        139       11.32       46.34
         14 |          2        0.16       46.50
         15 |          1        0.08       46.58
         16 |          8        0.65       47.23
         17 |          2        0.16       47.39
         18 |         26        2.12       49.51
         19 |        230       18.73       68.24
         20 |         16        1.30       69.54
         21 |         25        2.04       71.58
         22 |          9        0.73       72.31
         23 |         26        2.12       74.43
         24 |          6        0.49       74.92
         25 |         20        1.63       76.55
         26 |         16        1.30       77.85
         27 |         65        5.29       83.14
         28 |         20        1.63       84.77
         29 |         29        2.36       87.13
         30 |         35        2.85       89.98
         31 |         70        5.70       95.68
         32 |         25        2.04       97.72
         33 |          8        0.65       98.37
         34 |          6        0.49       98.86
         35 |          2        0.16       99.02
         36 |          2        0.16       99.19
         37 |          8        0.65       99.84
         38 |          2        0.16      100.00
------------+-----------------------------------
      Total |      1,228      100.00
.     drop DivisaoCNAE
. } 

. else {
.      di as error "N√£o foi poss√≠vel gerar dummies para Divis√£o do CNAE."
. }

. 
. capture confirm variable NaturezaJuridica

. if _rc == 0 {
.     tabulate NaturezaJuridica, generate(NaturezaJuridica_)

NaturezaJur |
      idica |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |          1        0.08        0.08
          0 |          5        0.41        0.49
          1 |         13        1.06        1.55
          2 |         92        7.49        9.04
          3 |      1,067       86.89       95.93
          4 |         23        1.87       97.80
          5 |          2        0.16       97.96
          6 |          1        0.08       98.05
          7 |          6        0.49       98.53
          8 |         18        1.47      100.00
------------+-----------------------------------
      Total |      1,228      100.00
.     drop NaturezaJuridica
. } 

. else {
.      di as error "N√£o foi poss√≠vel gerar dummies para NaturezaJuridica."
. }

. 
. 
. /*******************************************************************************
> ETAPA 6 - O CONJUNTO DE TESTE PERMANECE SEPARADO 
> *******************************************************************************/
. * O conjunto de teste ainda est√° salvo em "test_data.csv"
. * Ele ser√° importado separadamente no final da an√°lise.
. 
. /******************************************************************************
> Fornecer descri√ß√£o b√°sica da estrutura do conjunto de dados
> *******************************************************************************/
. describe

Contains data
 Observations:         1,228                  
    Variables:           130                  
------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------
LiqCorrente     float   %9.0g                 
LiqGeral        float   %9.0g                 
LiqCorAjust     float   %9.0g                 
SolvGeral       float   %9.0g                 
EndGeral        float   %9.0g                 
CompEndivid     float   %9.0g                 
IndepFin        float   %9.0g                 
ImobilPL        float   %9.0g                 
ImobRecNC       float   %9.0g                 
PtpCapTerce     float   %9.0g                 
GiroAtivo       float   %9.0g                 
MargOp          float   %9.0g                 
MargLiq         float   %9.0g                 
ROI             float   %9.0g                 
ROE             float   %9.0g                 
AC              double  %10.0g                
ANRP            double  %10.0g                
Investimentos   double  %10.0g                
Imobilizado     double  %10.0g                
Intangivel      double  %10.0g                
PC              double  %10.0g                
PNC             double  %10.0g                
PL              double  %10.0g                
RecBruta        double  %10.0g                
LucroBruto      double  %10.0g                
LucroLiquido    double  %10.0g                
QtePenalOutro~s int     %8.0g                 
vlrcontrato     float   %9.0g                 
IdadedeAnos     float   %9.0g                 
QtdeCNAEsSecu~s byte    %8.0g                 
AnodasDemonst~s int     %8.0g                 
log_vlrcontrato float   %9.0g                 
u               float   %9.0g                 
obs_no          int     %8.0g                 
total_obs       int     %8.0g                 
cutoff          int     %8.0g                 
FoiPenalizado~J byte    %8.0g                 
train           byte    %8.0g                 
Porte_1         byte    %8.0g                 Porte== 0.0000
Porte_2         byte    %8.0g                 Porte== 1.0000
Porte_3         byte    %8.0g                 Porte== 2.0000
Porte_4         byte    %8.0g                 Porte== 3.0000
CNAE_1          byte    %8.0g                 CNAE== -1.0000
CNAE_2          byte    %8.0g                 CNAE== 4.0000
CNAE_3          byte    %8.0g                 CNAE== 10.0000
CNAE_4          byte    %8.0g                 CNAE== 13.0000
CNAE_5          byte    %8.0g                 CNAE== 14.0000
CNAE_6          byte    %8.0g                 CNAE== 16.0000
CNAE_7          byte    %8.0g                 CNAE== 18.0000
CNAE_8          byte    %8.0g                 CNAE== 19.0000
CNAE_9          byte    %8.0g                 CNAE== 21.0000
CNAE_10         byte    %8.0g                 CNAE== 31.0000
CNAE_11         byte    %8.0g                 CNAE== 34.0000
CNAE_12         byte    %8.0g                 CNAE== 36.0000
CNAE_13         byte    %8.0g                 CNAE== 37.0000
CNAE_14         byte    %8.0g                 CNAE== 46.0000
CNAE_15         byte    %8.0g                 CNAE== 48.0000
CNAE_16         byte    %8.0g                 CNAE== 51.0000
CNAE_17         byte    %8.0g                 CNAE== 60.0000
CNAE_18         byte    %8.0g                 CNAE== 61.0000
CNAE_19         byte    %8.0g                 CNAE== 65.0000
CNAE_20         byte    %8.0g                 CNAE== 66.0000
CNAE_21         byte    %8.0g                 CNAE== 67.0000
CNAE_22         byte    %8.0g                 CNAE== 68.0000
CNAE_23         byte    %8.0g                 CNAE== 69.0000
CNAE_24         byte    %8.0g                 CNAE== 72.0000
CNAE_25         byte    %8.0g                 CNAE== 73.0000
CNAE_26         byte    %8.0g                 CNAE== 74.0000
CNAE_27         byte    %8.0g                 CNAE== 77.0000
CNAE_28         byte    %8.0g                 CNAE== 82.0000
CNAE_29         byte    %8.0g                 CNAE== 83.0000
CNAE_30         byte    %8.0g                 CNAE== 88.0000
CNAE_31         byte    %8.0g                 CNAE== 89.0000
CNAE_32         byte    %8.0g                 CNAE== 90.0000
CNAE_33         byte    %8.0g                 CNAE== 91.0000
CNAE_34         byte    %8.0g                 CNAE== 94.0000
CNAE_35         byte    %8.0g                 CNAE== 95.0000
CNAE_36         byte    %8.0g                 CNAE== 96.0000
CNAE_37         byte    %8.0g                 CNAE== 97.0000
CNAE_38         byte    %8.0g                 CNAE== 101.0000
DivisaoCNAE_1   byte    %8.0g                 DivisaoCNAE== -1.0000
DivisaoCNAE_2   byte    %8.0g                 DivisaoCNAE== 0.0000
DivisaoCNAE_3   byte    %8.0g                 DivisaoCNAE== 1.0000
DivisaoCNAE_4   byte    %8.0g                 DivisaoCNAE== 2.0000
DivisaoCNAE_5   byte    %8.0g                 DivisaoCNAE== 3.0000
DivisaoCNAE_6   byte    %8.0g                 DivisaoCNAE== 4.0000
DivisaoCNAE_7   byte    %8.0g                 DivisaoCNAE== 5.0000
DivisaoCNAE_8   byte    %8.0g                 DivisaoCNAE== 6.0000
DivisaoCNAE_9   byte    %8.0g                 DivisaoCNAE== 7.0000
DivisaoCNAE_10  byte    %8.0g                 DivisaoCNAE== 8.0000
DivisaoCNAE_11  byte    %8.0g                 DivisaoCNAE== 9.0000
DivisaoCNAE_12  byte    %8.0g                 DivisaoCNAE== 10.0000
DivisaoCNAE_13  byte    %8.0g                 DivisaoCNAE== 11.0000
DivisaoCNAE_14  byte    %8.0g                 DivisaoCNAE== 12.0000
DivisaoCNAE_15  byte    %8.0g                 DivisaoCNAE== 13.0000
DivisaoCNAE_16  byte    %8.0g                 DivisaoCNAE== 14.0000
DivisaoCNAE_17  byte    %8.0g                 DivisaoCNAE== 15.0000
DivisaoCNAE_18  byte    %8.0g                 DivisaoCNAE== 16.0000
DivisaoCNAE_19  byte    %8.0g                 DivisaoCNAE== 17.0000
DivisaoCNAE_20  byte    %8.0g                 DivisaoCNAE== 18.0000
DivisaoCNAE_21  byte    %8.0g                 DivisaoCNAE== 19.0000
DivisaoCNAE_22  byte    %8.0g                 DivisaoCNAE== 20.0000
DivisaoCNAE_23  byte    %8.0g                 DivisaoCNAE== 21.0000
DivisaoCNAE_24  byte    %8.0g                 DivisaoCNAE== 22.0000
DivisaoCNAE_25  byte    %8.0g                 DivisaoCNAE== 23.0000
DivisaoCNAE_26  byte    %8.0g                 DivisaoCNAE== 24.0000
DivisaoCNAE_27  byte    %8.0g                 DivisaoCNAE== 25.0000
DivisaoCNAE_28  byte    %8.0g                 DivisaoCNAE== 26.0000
DivisaoCNAE_29  byte    %8.0g                 DivisaoCNAE== 27.0000
DivisaoCNAE_30  byte    %8.0g                 DivisaoCNAE== 28.0000
DivisaoCNAE_31  byte    %8.0g                 DivisaoCNAE== 29.0000
DivisaoCNAE_32  byte    %8.0g                 DivisaoCNAE== 30.0000
DivisaoCNAE_33  byte    %8.0g                 DivisaoCNAE== 31.0000
DivisaoCNAE_34  byte    %8.0g                 DivisaoCNAE== 32.0000
DivisaoCNAE_35  byte    %8.0g                 DivisaoCNAE== 33.0000
DivisaoCNAE_36  byte    %8.0g                 DivisaoCNAE== 34.0000
DivisaoCNAE_37  byte    %8.0g                 DivisaoCNAE== 35.0000
DivisaoCNAE_38  byte    %8.0g                 DivisaoCNAE== 36.0000
DivisaoCNAE_39  byte    %8.0g                 DivisaoCNAE== 37.0000
DivisaoCNAE_40  byte    %8.0g                 DivisaoCNAE== 38.0000
NaturezaJurid~1 byte    %8.0g                 NaturezaJuridica== -1.0000
NaturezaJurid~2 byte    %8.0g                 NaturezaJuridica== 0.0000
NaturezaJurid~3 byte    %8.0g                 NaturezaJuridica== 1.0000
NaturezaJurid~4 byte    %8.0g                 NaturezaJuridica== 2.0000
NaturezaJurid~5 byte    %8.0g                 NaturezaJuridica== 3.0000
NaturezaJurid~6 byte    %8.0g                 NaturezaJuridica== 4.0000
NaturezaJurid~7 byte    %8.0g                 NaturezaJuridica== 5.0000
NaturezaJurid~8 byte    %8.0g                 NaturezaJuridica== 6.0000
NaturezaJurid~9 byte    %8.0g                 NaturezaJuridica== 7.0000
NaturezaJuri~10 byte    %8.0g                 NaturezaJuridica== 8.0000
------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. /*******************************************************************************
> ETAPA 6 - AN√ÅLISE LOGIT
> 
> A vari√°vel dependente √© 'FoiPenalizadoSTJ', do tipo bin√°ria.
> Ela indica se o fornecedor foi penalizado pelo STJ (1) ou n√£o (0).
> 
> As vari√°veis independentes ser√£o divididas em vari√°veis cont√°beis e vari√°veis de controle.
> 
> *******************************************************************************/
. * 6.1 Listar todas as vari√°veis dispon√≠veis
. ds
LiqCorrente   Intangivel    Porte_1       CNAE_16       CNAE_35       DivisaoCN~16  DivisaoCN~35
LiqGeral      PC            Porte_2       CNAE_17       CNAE_36       DivisaoCN~17  DivisaoCN~36
LiqCorAjust   PNC           Porte_3       CNAE_18       CNAE_37       DivisaoCN~18  DivisaoCN~37
SolvGeral     PL            Porte_4       CNAE_19       CNAE_38       DivisaoCN~19  DivisaoCN~38
EndGeral      RecBruta      CNAE_1        CNAE_20       DivisaoCN~_1  DivisaoCN~20  DivisaoCN~39
CompEndivid   LucroBruto    CNAE_2        CNAE_21       DivisaoCN~_2  DivisaoCN~21  DivisaoCN~40
IndepFin      LucroLiquido  CNAE_3        CNAE_22       DivisaoCN~_3  DivisaoCN~22  NaturezaJu~1
ImobilPL      QtePenalOu~s  CNAE_4        CNAE_23       DivisaoCN~_4  DivisaoCN~23  NaturezaJu~2
ImobRecNC     vlrcontrato   CNAE_5        CNAE_24       DivisaoCN~_5  DivisaoCN~24  NaturezaJu~3
PtpCapTerce   IdadedeAnos   CNAE_6        CNAE_25       DivisaoCN~_6  DivisaoCN~25  NaturezaJu~4
GiroAtivo     QtdeCNAEsS~s  CNAE_7        CNAE_26       DivisaoCN~_7  DivisaoCN~26  NaturezaJu~5
MargOp        AnodasDemo~s  CNAE_8        CNAE_27       DivisaoCN~_8  DivisaoCN~27  NaturezaJu~6
MargLiq       log_vlrcon~o  CNAE_9        CNAE_28       DivisaoCN~_9  DivisaoCN~28  NaturezaJu~7
ROI           u             CNAE_10       CNAE_29       DivisaoCN~10  DivisaoCN~29  NaturezaJu~8
ROE           obs_no        CNAE_11       CNAE_30       DivisaoCN~11  DivisaoCN~30  NaturezaJu~9
AC            total_obs     CNAE_12       CNAE_31       DivisaoCN~12  DivisaoCN~31  NaturezaJ~10
ANRP          cutoff        CNAE_13       CNAE_32       DivisaoCN~13  DivisaoCN~32
Investimen~s  FoiPenaliz~J  CNAE_14       CNAE_33       DivisaoCN~14  DivisaoCN~33
Imobilizado   train         CNAE_15       CNAE_34       DivisaoCN~15  DivisaoCN~34

. 
. * Capturar todas as vari√°veis que come√ßam com "Porte_"
. unab Porte_vars : Porte_*

. 
. * Capturar todas as vari√°veis que come√ßam com "CNAE_"
. unab CNAE_vars : CNAE_*

. 
. * Capturar todas as vari√°veis que come√ßam com "NaturezaJuridica_"
. unab Natureza_vars : NaturezaJuridica_*

. 
. * Definir vari√°veis cont√°beis e de controle corretamente
. local var_contabeis `Porte_vars' LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid Ind
> epFin ImobilPL ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE

. 
. local var_controle `CNAE_vars' `Natureza_vars' log_vlrcon~o  QtdeCNAEsS~s IdadedeAnos QtePenalOu~s

. 
. *local var_controle log_vlrcontrato `Natureza_vars' qtdecnaess~s idadedeanos qtepenalou~s
. 
. * Executar a regress√£o log√≠stica
. logit FoiPenalizadoSTJ `var_contabeis' `var_controle' if train == 1

note: CNAE_2 != 0 predicts failure perfectly;
      CNAE_2 omitted and 10 obs not used.

note: CNAE_4 != 0 predicts success perfectly;
      CNAE_4 omitted and 11 obs not used.

note: CNAE_6 != 0 predicts success perfectly;
      CNAE_6 omitted and 10 obs not used.

note: CNAE_9 != 0 predicts success perfectly;
      CNAE_9 omitted and 16 obs not used.

note: CNAE_10 != 0 predicts success perfectly;
      CNAE_10 omitted and 18 obs not used.

note: CNAE_11 != 0 predicts success perfectly;
      CNAE_11 omitted and 18 obs not used.

note: CNAE_14 != 0 predicts success perfectly;
      CNAE_14 omitted and 15 obs not used.

note: CNAE_20 != 0 predicts failure perfectly;
      CNAE_20 omitted and 15 obs not used.

note: CNAE_22 != 0 predicts failure perfectly;
      CNAE_22 omitted and 42 obs not used.

note: CNAE_24 != 0 predicts success perfectly;
      CNAE_24 omitted and 12 obs not used.

note: CNAE_25 != 0 predicts success perfectly;
      CNAE_25 omitted and 12 obs not used.

note: CNAE_26 != 0 predicts success perfectly;
      CNAE_26 omitted and 10 obs not used.

note: CNAE_28 != 0 predicts success perfectly;
      CNAE_28 omitted and 13 obs not used.

note: CNAE_31 != 0 predicts failure perfectly;
      CNAE_31 omitted and 15 obs not used.

note: CNAE_34 != 0 predicts failure perfectly;
      CNAE_34 omitted and 13 obs not used.

note: CNAE_36 != 0 predicts failure perfectly;
      CNAE_36 omitted and 14 obs not used.

note: CNAE_37 != 0 predicts failure perfectly;
      CNAE_37 omitted and 9 obs not used.

note: CNAE_38 != 0 predicts success perfectly;
      CNAE_38 omitted and 9 obs not used.

note: NaturezaJuridica_7 != 0 predicts failure perfectly;
      NaturezaJuridica_7 omitted and 2 obs not used.

note: NaturezaJuridica_8 != 0 predicts failure perfectly;
      NaturezaJuridica_8 omitted and 1 obs not used.

note: NaturezaJuridica_10 != 0 predicts failure perfectly;
      NaturezaJuridica_10 omitted and 15 obs not used.

note: Porte_4 omitted because of collinearity.
note: PtpCapTerce omitted because of collinearity.
note: CNAE_35 omitted because of collinearity.
note: NaturezaJuridica_1 omitted because of collinearity.
note: NaturezaJuridica_2 omitted because of collinearity.
note: NaturezaJuridica_9 omitted because of collinearity.
Iteration 0:  Log likelihood = -528.13616  
Iteration 1:  Log likelihood = -356.73301  
Iteration 2:  Log likelihood = -350.72745  
Iteration 3:  Log likelihood = -350.51091  
Iteration 4:  Log likelihood = -350.50581  
Iteration 5:  Log likelihood =  -350.5047  
Iteration 6:  Log likelihood = -350.50443  
Iteration 7:  Log likelihood = -350.50438  
Iteration 8:  Log likelihood = -350.50436  

Logistic regression                                     Number of obs =    762
                                                        LR chi2(44)   = 355.26
                                                        Prob > chi2   = 0.0000
Log likelihood = -350.50436                             Pseudo R2     = 0.3363

--------------------------------------------------------------------------------------
    FoiPenalizadoSTJ | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             Porte_1 |  -1.460027   .4689686    -3.11   0.002    -2.379189   -.5408655
             Porte_2 |   .1305406   .3405275     0.38   0.701     -.536881    .7979622
             Porte_3 |  -.6975809   .4227246    -1.65   0.099    -1.526106    .1309442
             Porte_4 |          0  (omitted)
         LiqCorrente |  -.0074929   .0102238    -0.73   0.464    -.0275311    .0125453
            LiqGeral |   .0053694   .0193487     0.28   0.781    -.0325534    .0432923
         LiqCorAjust |   .1464518   .5657776     0.26   0.796    -.9624519    1.255355
           SolvGeral |   1.116346   1.948268     0.57   0.567    -2.702189    4.934881
            EndGeral |   .1206947   .0658622     1.83   0.067    -.0083929    .2497823
         CompEndivid |  -.4273781   .4869049    -0.88   0.380    -1.381694    .5269379
            IndepFin |  -1.109732    1.94731    -0.57   0.569    -4.926389    2.706926
            ImobilPL |  -1.210605   .5770976    -2.10   0.036    -2.341696   -.0795145
           ImobRecNC |   1.271616   1.007998     1.26   0.207    -.7040236    3.247256
         PtpCapTerce |          0  (omitted)
           GiroAtivo |  -.0596442   .1129858    -0.53   0.598    -.2810923    .1618039
              MargOp |  -.5075466   .4019215    -1.26   0.207    -1.295298    .2802051
             MargLiq |  -.5720995    .459491    -1.25   0.213    -1.472685    .3284863
                 ROI |  -.3955591   .7199051    -0.55   0.583    -1.806547    1.015429
                 ROE |   .0422036   .2635964     0.16   0.873    -.4744358    .5588431
              CNAE_1 |  -1.136114   .6315397    -1.80   0.072    -2.373909    .1016815
              CNAE_2 |          0  (omitted)
              CNAE_3 |    4.80964    1.19357     4.03   0.000     2.470285    7.148994
              CNAE_4 |          0  (omitted)
              CNAE_5 |  -.0328464   .6879224    -0.05   0.962     -1.38115    1.315457
              CNAE_6 |          0  (omitted)
              CNAE_7 |    .157365   .7549657     0.21   0.835    -1.322341    1.637071
              CNAE_8 |   1.489781   .7910187     1.88   0.060    -.0605867     3.04015
              CNAE_9 |          0  (omitted)
             CNAE_10 |          0  (omitted)
             CNAE_11 |          0  (omitted)
             CNAE_12 |   .2993088   .6652673     0.45   0.653    -1.004591    1.603209
             CNAE_13 |   .0894267   .7836464     0.11   0.909    -1.446492    1.625345
             CNAE_14 |          0  (omitted)
             CNAE_15 |   .5064304   .6581083     0.77   0.442    -.7834382    1.796299
             CNAE_16 |   .2343334   .9734834     0.24   0.810    -1.673659    2.142326
             CNAE_17 |   11.17453   1086.599     0.01   0.992     -2118.52    2140.869
             CNAE_18 |   2.274212   1.201493     1.89   0.058     -.080671    4.629095
             CNAE_19 |  -.7084462   .8094983    -0.88   0.381    -2.295034    .8781413
             CNAE_20 |          0  (omitted)
             CNAE_21 |   -1.50737   .8839298    -1.71   0.088    -3.239841    .2251007
             CNAE_22 |          0  (omitted)
             CNAE_23 |    1.20822   .6300373     1.92   0.055    -.0266306     2.44307
             CNAE_24 |          0  (omitted)
             CNAE_25 |          0  (omitted)
             CNAE_26 |          0  (omitted)
             CNAE_27 |  -1.764693   1.005504    -1.76   0.079    -3.735446    .2060595
             CNAE_28 |          0  (omitted)
             CNAE_29 |    .547686   .9366912     0.58   0.559    -1.288195    2.383567
             CNAE_30 |   3.175612   .8604556     3.69   0.000      1.48915    4.862074
             CNAE_31 |          0  (omitted)
             CNAE_32 |  -.1800073   .7034069    -0.26   0.798     -1.55866    1.198645
             CNAE_33 |   1.699999   .9361511     1.82   0.069    -.1348233    3.534821
             CNAE_34 |          0  (omitted)
             CNAE_35 |          0  (omitted)
             CNAE_36 |          0  (omitted)
             CNAE_37 |          0  (omitted)
             CNAE_38 |          0  (omitted)
  NaturezaJuridica_1 |          0  (omitted)
  NaturezaJuridica_2 |          0  (omitted)
  NaturezaJuridica_3 |  -12.59086   1086.599    -0.01   0.991    -2142.285    2117.104
  NaturezaJuridica_4 |  -5.629078   1.204988    -4.67   0.000     -7.99081   -3.267345
  NaturezaJuridica_5 |  -1.914898   .9895654    -1.94   0.053    -3.854411     .024614
  NaturezaJuridica_6 |  -2.986609   1.295249    -2.31   0.021    -5.525252   -.4479671
  NaturezaJuridica_7 |          0  (omitted)
  NaturezaJuridica_8 |          0  (omitted)
  NaturezaJuridica_9 |          0  (omitted)
 NaturezaJuridica_10 |          0  (omitted)
     log_vlrcontrato |   .0754029   .0155893     4.84   0.000     .0448485    .1059573
QtdeCNAEsSecundarios |  -.0151293   .0074542    -2.03   0.042    -.0297393   -.0005192
         IdadedeAnos |   .0057252   .0118584     0.48   0.629    -.0175169    .0289673
QtePenalOutrosOrgaos |   .0344976    .006681     5.16   0.000     .0214031    .0475921
               _cons |   .9145095   2.273286     0.40   0.687    -3.541049    5.370068
--------------------------------------------------------------------------------------

. 
. * Armazenar os resultados do modelo completo
. estimates store IRDCcompleto

. 
. /*******************************************************************************
> Justificativa das Vari√°veis de Controle:
> 
> - **CNAE (Classifica√ß√£o Nacional de Atividades Econ√¥micas)**: Diferentes setores econ√¥micos possuem 
> n√≠veis distintos de regula√ß√£o e riscos operacionais. Incluir o CNAE permite controlar os efeitos esp
> ec√≠ficos de cada setor na probabilidade de penaliza√ß√£o.
> 
> - **Natureza Jur√≠dica**: Empresas com diferentes naturezas jur√≠dicas t√™m estruturas legais e de gove
> rnan√ßa distintas, o que pode influenciar a conformidade regulat√≥ria e o risco de penalidades.
> 
> - **log_vlrcontrato (Log do Valor do Contrato)**: Contratos de maior valor podem estar sujeitos a ma
> ior escrut√≠nio e complexidade, aumentando o risco de penalidades. O logaritmo √© usado para lineariza
> r a rela√ß√£o.
> 
> - **QtdeCNAEsSecundarios (Quantidade de CNAEs Secund√°rios)**: Indica o n√≠vel de diversifica√ß√£o das a
> tividades da empresa. Empresas mais diversificadas podem ter estruturas mais complexas, afetando a g
> est√£o e a conformidade regulat√≥ria.
> 
> - **IdadedeAnos (Idade da Empresa em Anos)**: Empresas mais antigas podem ter processos mais estabel
> ecidos e experi√™ncia acumulada, afetando positivamente a conformidade com normas e regulamentos.
> 
> - **QtePenalOutrosOrgaos (Quantidade de Penalidades Aplicadas por Outros √ìrg√£os)**: Um hist√≥rico de 
> penalidades pode indicar padr√µes de n√£o conformidade, aumentando a probabilidade de novas penaliza√ß√µ
> es.
> 
> Essas vari√°veis de controle s√£o importantes para isolar o efeito das vari√°veis cont√°beis principais,
>  garantindo que os resultados do modelo reflitam o impacto dos indicadores cont√°beis na probabilidad
> e de penaliza√ß√£o, independentemente de outros fatores externos.
> 
> *******************************************************************************/
. 
. /*******************************************************************************
> 6.1.1 Teste de Bondade de Ajuste de Hosmer-Lemeshow para o modelo completo na base de treinamento
> *******************************************************************************/
. estat gof if train == 1, group(10) table
note: obs collapsed on 10 quantiles of estimated probabilities.

Goodness-of-fit test after logistic model
Variable: FoiPenalizadoSTJ

  Table collapsed on quantiles of estimated probabilities
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.0921 |     8 |   3.6 |    69 |  73.4 |    77 |
  |     2 | 0.1640 |     7 |  10.3 |    69 |  65.7 |    76 |
  |     3 | 0.2463 |    19 |  15.5 |    57 |  60.5 |    76 |
  |     4 | 0.3736 |    16 |  23.9 |    60 |  52.1 |    76 |
  |     5 | 0.4705 |    36 |  31.9 |    40 |  44.1 |    76 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5787 |    37 |  39.9 |    40 |  37.1 |    77 |
  |     7 | 0.7173 |    43 |  49.0 |    33 |  27.0 |    76 |
  |     8 | 0.8251 |    67 |  58.5 |     9 |  17.5 |    76 |
  |     9 | 0.9717 |    69 |  69.6 |     7 |   6.4 |    76 |
  |    10 | 0.9973 |    75 |  74.8 |     1 |   1.2 |    76 |
  +--------------------------------------------------------+

 Number of observations =    762
       Number of groups =     10
Hosmer‚ÄìLemeshow chi2(8) =  20.56
            Prob > chi2 = 0.0084

. 
. /*******************************************************************************
> 6.1.2 Tabela de classifica√ß√£o para o modelo completo na base de treinamento
> *******************************************************************************/
. estat class if train == 1

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |       280            79  |        359
     -     |        97           306  |        403
-----------+--------------------------+-----------
   Total   |       377           385  |        762

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   74.27%
Specificity                     Pr( -|~D)   79.48%
Positive predictive value       Pr( D| +)   77.99%
Negative predictive value       Pr(~D| -)   75.93%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   20.52%
False - rate for true D         Pr( -| D)   25.73%
False + rate for classified +   Pr(~D| +)   22.01%
False - rate for classified -   Pr( D| -)   24.07%
--------------------------------------------------
Correctly classified                        76.90%
--------------------------------------------------

. 
. * üìå Gerar predi√ß√µes na base de treinamento
. capture drop prob_pred_treino

. predict prob_pred_treino if train == 1, pr
(466 missing values generated)

. 
. * üìå Classifica√ß√£o prevista
. capture drop predicted_class_treino

. gen predicted_class_treino = (prob_pred_treino >= 0.5) if train == 1
(186 missing values generated)

. 
. * üìå Kappa na base de treinamento
. *ssc install kappaetc, replace
. kappaetc FoiPenalizadoSTJ predicted_class_treino if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7006    0.0142  49.35   0.000     0.6727     0.7284
Brennan and Prediger |  0.4012    0.0284  14.13   0.000     0.3454     0.4569
Cohen/Conger's Kappa |  0.4012    0.0277  14.51   0.000     0.3469     0.4554
    Scott/Fleiss' Pi |  0.3934    0.0287  13.72   0.000     0.3371     0.4496
           Gwet's AC |  0.4087    0.0285  14.32   0.000     0.3527     0.4647
Krippendorff's Alpha |  0.3937    0.0287  13.73   0.000     0.3374     0.4499
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de treinamento
. capture drop correct_classification_treino

. gen correct_classification_treino = (FoiPenalizadoSTJ == predicted_class_treino) if train == 1
(186 missing values generated)

. sum correct_classification_treino if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~o |      1,042    .7005758    .4582258          0          1

. scalar prop_modelo_treino = r(mean)

. 
. * üìå No Information Rate (NIR)
. *O NIR representa a acur√°cia de um modelo nulo (baseline), que classifica sempre a categoria mais fr
> equente.
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_treino)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_treino = freq_treino[1,1] + freq_treino[2,1]

. scalar max_treino = max(freq_treino[1,1], freq_treino[2,1])

. scalar prop_nir_treino = max_treino / total_treino

. 
. * üìå Compara√ß√£o
. di "Acur√°cia na base de treinamento: " prop_modelo_treino
Acur√°cia na base de treinamento: .70057582

. di "NIR (treinamento): " prop_nir_treino
NIR (treinamento): .5

. 
. if (prop_modelo_treino > prop_nir_treino) {
.     di "‚úÖ Modelo completo supera o NIR na base de treino."
‚úÖ Modelo completo supera o NIR na base de treino.
. }

. else {
.     di "‚ö†Ô∏è Modelo completo N√ÉO supera o NIR na base de treino."
. }

. 
. * üìå Teste de McNemar na base de treinamento
. * Criar a matriz de confus√£o da base de teste
. tabulate FoiPenalizadoSTJ predicted_class_treino if train == 1, matcell(mc_treino)

           | predicted_class_trein
FoiPenaliz |           o
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       306        215 |       521 
         1 |        97        424 |       521 
-----------+----------------------+----------
     Total |       403        639 |     1,042 

. 
. * Extrair os valores da matriz
. scalar tn_treino = mc_treino[1,1] // Verdadeiro Negativo

. scalar fn_treino = mc_treino[2,1] // Falso Negativo

. scalar fp_treino = mc_treino[1,2] // Falso Positivo

. scalar tp_treino = mc_treino[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_treino
TN: 306

. di "FN: " fn_treino
FN: 97

. di "FP: " fp_treino
FP: 215

. di "TP: " tp_treino
TP: 424

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_treino' `=fn_treino' `=fp_treino' `=tp_treino'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       306          97  |        403
       Unexposed |       215         424  |        639
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =     44.63    Prob > chi2 = 0.0000
Exact McNemar significance probability       = 0.0000

Proportion with factor
        Cases       .3867562
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference -.1132438     -.1467086  -.0797789
        ratio       .7735125      .7172241   .8342184
        rel. diff. -.2264875     -.3000776  -.1528975

        odds ratio  .4511628      .3512568   .5759963   (exact)

. 
. /*******************************************************************************
> 6.1.3 Curva ROC para o modelo completo na base de TREINO
> *******************************************************************************/
. lroc if train == 1

Logistic model for FoiPenalizadoSTJ

Number of observations =      762
Area under ROC curve   =   0.8614

. graph export "lroc_IRDCcompleto_treino.png", replace
file lroc_IRDCcompleto_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.1.5 Tabela de classifica√ß√£o para o modelo completo na base de TESTE
> *******************************************************************************/
. estat class if train == 0

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        23            18  |         41
     -     |        25            85  |        110
-----------+--------------------------+-----------
   Total   |        48           103  |        151

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   47.92%
Specificity                     Pr( -|~D)   82.52%
Positive predictive value       Pr( D| +)   56.10%
Negative predictive value       Pr(~D| -)   77.27%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   17.48%
False - rate for true D         Pr( -| D)   52.08%
False + rate for classified +   Pr(~D| +)   43.90%
False - rate for classified -   Pr( D| -)   22.73%
--------------------------------------------------
Correctly classified                        71.52%
--------------------------------------------------

. 
. * üìå Gerar predi√ß√µes na base de treinamento
. capture drop prob_pred_teste

. predict prob_pred_teste if train == 0, pr
(1,077 missing values generated)

. 
. * üìå Classifica√ß√£o prevista
. capture drop predicted_class_teste

. gen predicted_class_teste = (prob_pred_teste >= 0.5) if train == 0
(1,042 missing values generated)

. 
. * üìå Kappa na base de treinamento
. kappaetc FoiPenalizadoSTJ predicted_class_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.6237    0.0356  17.51   0.000     0.5534     0.6939
Brennan and Prediger |  0.2473    0.0712   3.47   0.001     0.1068     0.3879
Cohen/Conger's Kappa |  0.1883    0.0719   2.62   0.010     0.0465     0.3301
    Scott/Fleiss' Pi |  0.1780    0.0742   2.40   0.017     0.0317     0.3243
           Gwet's AC |  0.3058    0.0744   4.11   0.000     0.1591     0.4525
Krippendorff's Alpha |  0.1802    0.0742   2.43   0.016     0.0339     0.3265
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de treinamento
. capture drop correct_classification_teste

. gen correct_classification_teste = (FoiPenalizadoSTJ == predicted_class_teste) if train == 0
(1,042 missing values generated)

. sum correct_classification_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~e |        186    .6236559    .4857756          0          1

. scalar prop_modelo_teste = r(mean)

. 
. * üìå No Information Rate (NIR)
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar prop_nir_teste = max_teste / total_teste

. 
. 
. * üìå Compara√ß√£o
. di "Acur√°cia na base de teste: " prop_modelo_teste
Acur√°cia na base de teste: .62365591

. di "NIR (teste): " prop_nir_teste
NIR (teste): .69892473

. 
. if (prop_modelo_teste > prop_nir_teste) {
.     di "‚úÖ Modelo completo supera o NIR na base de teste."
. }

. else {
.     di "‚ö†Ô∏è Modelo completo N√ÉO supera o NIR na base de teste."
‚ö†Ô∏è Modelo completo N√ÉO supera o NIR na base de teste.
. }

. 
. * üìå Teste de McNemar na base de teste
. * Criar a matriz de confus√£o da base de teste
. tabulate FoiPenalizadoSTJ predicted_class_teste if train == 0, matcell(mc_teste)

FoiPenaliz | predicted_class_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |        85         45 |       130 
         1 |        25         31 |        56 
-----------+----------------------+----------
     Total |       110         76 |       186 

. 
. * Extrair os valores da matriz
. scalar tn_teste = mc_teste[1,1] // Verdadeiro Negativo

. scalar fn_teste = mc_teste[2,1] // Falso Negativo

. scalar fp_teste = mc_teste[1,2] // Falso Positivo

. scalar tp_teste = mc_teste[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_teste
TN: 85

. di "FN: " fn_teste
FN: 25

. di "FP: " fp_teste
FP: 45

. di "TP: " tp_teste
TP: 31

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |        85          25  |        110
       Unexposed |        45          31  |         76
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =      5.71    Prob > chi2 = 0.0168
Exact McNemar significance probability       = 0.0225

Proportion with factor
        Cases       .5913978
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference -.1075269      -.199701  -.0153528
        ratio       .8461538      .7377258   .9705182
        rel. diff. -.3571429     -.6982744  -.0160113

        odds ratio  .5555556      .3264759   .9255458   (exact)

. 
. /*******************************************************************************
> 6.1.6 Curva ROC para o modelo completo na base de TESTE
> *******************************************************************************/
. lroc if train == 0

Logistic model for FoiPenalizadoSTJ

Number of observations =      151
Area under ROC curve   =   0.7269

. graph export "lroc_IRDCcompleto_teste.png", replace
file lroc_IRDCcompleto_teste.png saved as PNG format

. 
. /*******************************************************************************
> 6.1.7 ‚Äì Ponto de Corte Ideal (Sensibilidade ‚âà Especificidade)
> *******************************************************************************/
. 
. * Reexecutar rapidamente o modelo (sem sobrescrever)
. quietly logit FoiPenalizadoSTJ `var_contabeis' `var_controle' if train == 1

. 
. * Restaurar modelo salvo
. estimates restore IRDCcompleto
(results IRDCcompleto are active now)

. 
. * üìå BASE DE TREINAMENTO
. * ------------------------------------------------------------
. * Garantir que as vari√°veis tempor√°rias n√£o existam
. capture drop prob_pred_treino

. capture drop cutoff

. capture drop sens

. capture drop spec

. capture drop difference

. capture drop abs_diff

. capture drop ordem

. 
. * Gerar predi√ß√µes
. predict prob_pred_treino if train == 1, pr
(466 missing values generated)

. 
. * Gerar sensitividade e especificidade para diferentes cutoffs
. lsens if train == 1, genprob(cutoff) gensens(sens) genspec(spec) nograph

. 
. * Calcular diferen√ßa entre sensibilidade e especificidade
. gen difference = sens - spec
(467 missing values generated)

. gen abs_diff = abs(difference)
(467 missing values generated)

. 
. * Obter ponto ideal (menor diferen√ßa)
. gen ordem = _n

. gsort abs_diff

. 
. * Salvar valores do melhor ponto em scalars usando summarize
. summarize cutoff if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      cutoff |          1    .4729059           .   .4729059   .4729059

. scalar cutoff_ideal_treino = r(mean)

. scalar cutoff_completo = cutoff_ideal_treino

. 
. summarize sens if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        sens |          1    .7692308           .   .7692308   .7692308

. scalar sens_ideal_treino = r(mean)

. 
. summarize spec if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        spec |          1    .7688311           .   .7688311   .7688311

. scalar spec_ideal_treino = r(mean)

. 
. * Mostrar o ponto ideal encontrado
. list cutoff sens spec abs_diff in 1, noobs clean

      cutoff       sens       spec   abs_diff  
    0.472906   0.769231   0.768831   .0003996  

. 
. * Plotar gr√°fico com destaque no ponto de cruzamento
. lsens if train == 1, ///
>     yline(`=sens_ideal_treino') xline(`=cutoff_ideal_treino') ///
>     scheme(s1color) ///
>     ylab(0 0.2 `=sens_ideal_treino' 0.8 1) ///
>     xlab(0 0.2 `=cutoff_ideal_treino' 0.8 1)

. 
. graph export "cutoff_ideal_treino.png", replace
file cutoff_ideal_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.1.8 ‚Äì Tabela de Classifica√ß√£o com Cutoff Ideal (Treinamento e Teste)
> *******************************************************************************/
. 
. * üìå BASE DE TREINAMENTO
. * ------------------------------------------------------------
. 
. di "Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO: " cutoff_ideal_treino
Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO: .47290593

. 
. * Gerar classifica√ß√£o com o cutoff ideal
. capture drop predicted_class_treino

. gen predicted_class_treino = (prob_pred_treino >= cutoff_ideal_treino) if train == 1
(186 missing values generated)

. 
. * Matriz de classifica√ß√£o detalhada
. estat class if train == 1

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |       280            79  |        359
     -     |        97           306  |        403
-----------+--------------------------+-----------
   Total   |       377           385  |        762

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   74.27%
Specificity                     Pr( -|~D)   79.48%
Positive predictive value       Pr( D| +)   77.99%
Negative predictive value       Pr(~D| -)   75.93%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   20.52%
False - rate for true D         Pr( -| D)   25.73%
False + rate for classified +   Pr(~D| +)   22.01%
False - rate for classified -   Pr( D| -)   24.07%
--------------------------------------------------
Correctly classified                        76.90%
--------------------------------------------------

. 
. * Kappa
. kappaetc FoiPenalizadoSTJ predicted_class_treino if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7006    0.0142  49.35   0.000     0.6727     0.7284
Brennan and Prediger |  0.4012    0.0284  14.13   0.000     0.3454     0.4569
Cohen/Conger's Kappa |  0.4012    0.0274  14.65   0.000     0.3474     0.4549
    Scott/Fleiss' Pi |  0.3905    0.0288  13.58   0.000     0.3340     0.4469
           Gwet's AC |  0.4115    0.0286  14.40   0.000     0.3554     0.4676
Krippendorff's Alpha |  0.3908    0.0288  13.59   0.000     0.3343     0.4472
------------------------------------------------------------------------------

. 
. * Acur√°cia
. capture drop correct_classification_treino

. gen correct_classification_treino = (FoiPenalizadoSTJ == predicted_class_treino) if train == 1
(186 missing values generated)

. sum correct_classification_treino if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~o |      1,042    .7005758    .4582258          0          1

. scalar prop_modelo_treino = r(mean)

. 
. * No Information Rate
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_treino)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_treino = freq_treino[1,1] + freq_treino[2,1]

. scalar max_treino = max(freq_treino[1,1], freq_treino[2,1])

. scalar prop_nir_treino = max_treino / total_treino

. 
. di "Acur√°cia (treino): " prop_modelo_treino
Acur√°cia (treino): .70057582

. di "NIR (treino): " prop_nir_treino
NIR (treino): .5

. 
. if (prop_modelo_treino > prop_nir_treino) {
.     di "‚úÖ Modelo supera o NIR na base de treino (cutoff ideal)."
‚úÖ Modelo supera o NIR na base de treino (cutoff ideal).
. }

. else {
.     di "‚ö†Ô∏è Modelo N√ÉO supera o NIR na base de treino (cutoff ideal)."
. }

. 
. * Teste de McNemar
. tabulate FoiPenalizadoSTJ predicted_class_treino if train == 1, matcell(mc_treino)

           | predicted_class_trein
FoiPenaliz |           o
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       296        225 |       521 
         1 |        87        434 |       521 
-----------+----------------------+----------
     Total |       383        659 |     1,042 

. scalar tn_treino = mc_treino[1,1]

. scalar fn_treino = mc_treino[2,1]

. scalar fp_treino = mc_treino[1,2]

. scalar tp_treino = mc_treino[2,2]

. mcci `=tn_treino' `=fn_treino' `=fp_treino' `=tp_treino'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       296          87  |        383
       Unexposed |       225         434  |        659
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =     61.04    Prob > chi2 = 0.0000
Exact McNemar significance probability       = 0.0000

Proportion with factor
        Cases       .3675624
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference -.1324376      -.165634  -.0992413
        ratio       .7351248      .6803037   .7943635
        rel. diff. -.2648752     -.3396081  -.1901424

        odds ratio  .3866667      .2983558   .4973477   (exact)

. 
. 
. * üìå BASE DE TESTE
. * ------------------------------------------------------------
. 
. di "Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO (aplicado na base de TE
> STE): " cutoff_ideal_treino
Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO (aplicado na base de TESTE): 
> .47290593

. 
. * Gerar classifica√ß√£o com o mesmo cutoff da base de treino
. capture drop predicted_class_teste

. gen predicted_class_teste = (prob_pred_teste >= cutoff_ideal_treino) if train == 0
(1,042 missing values generated)

. 
. * Matriz de classifica√ß√£o detalhada
. estat class if train == 0

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        23            18  |         41
     -     |        25            85  |        110
-----------+--------------------------+-----------
   Total   |        48           103  |        151

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   47.92%
Specificity                     Pr( -|~D)   82.52%
Positive predictive value       Pr( D| +)   56.10%
Negative predictive value       Pr(~D| -)   77.27%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   17.48%
False - rate for true D         Pr( -| D)   52.08%
False + rate for classified +   Pr(~D| +)   43.90%
False - rate for classified -   Pr( D| -)   22.73%
--------------------------------------------------
Correctly classified                        71.52%
--------------------------------------------------

. 
. * Kappa
. kappaetc FoiPenalizadoSTJ predicted_class_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.6129    0.0358  17.11   0.000     0.5423     0.6836
Brennan and Prediger |  0.2258    0.0716   3.15   0.002     0.0845     0.3671
Cohen/Conger's Kappa |  0.1802    0.0708   2.55   0.012     0.0406     0.3199
    Scott/Fleiss' Pi |  0.1655    0.0740   2.24   0.026     0.0196     0.3114
           Gwet's AC |  0.2780    0.0749   3.71   0.000     0.1303     0.4257
Krippendorff's Alpha |  0.1677    0.0740   2.27   0.024     0.0218     0.3137
------------------------------------------------------------------------------

. 
. * Acur√°cia
. capture drop correct_classification_teste

. gen correct_classification_teste = (FoiPenalizadoSTJ == predicted_class_teste) if train == 0
(1,042 missing values generated)

. sum correct_classification_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~e |        186    .6129032    .4884008          0          1

. scalar prop_modelo_teste = r(mean)

. 
. * No Information Rate
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar prop_nir_teste = max_teste / total_teste

. 
. di "Acur√°cia (teste): " prop_modelo_teste
Acur√°cia (teste): .61290323

. di "NIR (teste): " prop_nir_teste
NIR (teste): .69892473

. 
. if (prop_modelo_teste > prop_nir_teste) {
.     di "‚úÖ Modelo supera o NIR na base de teste (cutoff ideal do treino)."
. }

. else {
.     di "‚ö†Ô∏è Modelo N√ÉO supera o NIR na base de teste (cutoff ideal do treino)."
‚ö†Ô∏è Modelo N√ÉO supera o NIR na base de teste (cutoff ideal do treino).
. }

. 
. * Teste de McNemar
. tabulate FoiPenalizadoSTJ predicted_class_teste if train == 0, matcell(mc_teste)

FoiPenaliz | predicted_class_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |        82         48 |       130 
         1 |        24         32 |        56 
-----------+----------------------+----------
     Total |       106         80 |       186 

. scalar tn_teste = mc_teste[1,1]

. scalar fn_teste = mc_teste[2,1]

. scalar fp_teste = mc_teste[1,2]

. scalar tp_teste = mc_teste[2,2]

. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |        82          24  |        106
       Unexposed |        48          32  |         80
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =      8.00    Prob > chi2 = 0.0047
Exact McNemar significance probability       = 0.0063

Proportion with factor
        Cases       .5698925
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference -.1290323     -.2218778  -.0361868
        ratio       .8153846      .7076758   .9394868
        rel. diff. -.4285714     -.7835297  -.0736132

        odds ratio        .5      .2929308   .8324956   (exact)

. 
. 
. /*******************************************************************************
> 6.2 Regress√£o log√≠stica com sele√ß√£o stepwise a 5% de signific√¢ncia no conjunto de treinamento
> *******************************************************************************/
. * Capturar todas as vari√°veis que come√ßam com "Porte_"
. unab Porte_vars : Porte_*

. 
. * Capturar todas as vari√°veis que come√ßam com "CNAE_"
. unab CNAE_vars : CNAE_*

. 
. * Capturar todas as vari√°veis que come√ßam com "NaturezaJuridica_"
. unab Natureza_vars : NaturezaJuridica_*

. 
. * Definir vari√°veis cont√°beis e de controle corretamente
. local var_contabeis `Porte_vars' LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid Ind
> epFin ImobilPL ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE

. 
. *local var_controle `CNAE_vars' `Natureza_vars' log_vlrcontrato qtdecnaess~s idadedeanos qtepenalou~
> s
. 
. local var_controle `CNAE_vars' `Natureza_vars' log_vlrcon~o  QtdeCNAEsS~s IdadedeAnos QtePenalOu~s

. 
. *Regress√£o log√≠stica com sele√ß√£o stepwise a 5% 
. sw, pr(.05): logit FoiPenalizadoSTJ `var_contabeis' `var_controle' if train == 1
note: Porte_4 omitted because of estimability.
note: PtpCapTerce omitted because of estimability.
note: CNAE_2 omitted because of estimability.
note: CNAE_4 omitted because of estimability.
note: CNAE_6 omitted because of estimability.
note: CNAE_9 omitted because of estimability.
note: CNAE_10 omitted because of estimability.
note: CNAE_11 omitted because of estimability.
note: CNAE_14 omitted because of estimability.
note: CNAE_20 omitted because of estimability.
note: CNAE_22 omitted because of estimability.
note: CNAE_24 omitted because of estimability.
note: CNAE_25 omitted because of estimability.
note: CNAE_26 omitted because of estimability.
note: CNAE_28 omitted because of estimability.
note: CNAE_31 omitted because of estimability.
note: CNAE_34 omitted because of estimability.
note: CNAE_35 omitted because of estimability.
note: CNAE_36 omitted because of estimability.
note: CNAE_37 omitted because of estimability.
note: CNAE_38 omitted because of estimability.
note: o.NaturezaJuridica_1 omitted because of estimability.
note: NaturezaJuridica_2 omitted because of estimability.
note: NaturezaJuridica_7 omitted because of estimability.
note: NaturezaJuridica_8 omitted because of estimability.
note: NaturezaJuridica_9 omitted because of estimability.
note: NaturezaJuridica_10 omitted because of estimability.
note: 280 obs omitted because of estimability.

Wald test, begin with full model:
p = 0.9918 >= 0.0500, removing CNAE_17
p = 0.9388 >= 0.0500, removing CNAE_5
p = 0.8695 >= 0.0500, removing ROE
p = 0.8520 >= 0.0500, removing CNAE_13
p = 0.8240 >= 0.0500, removing LiqCorAjust
p = 0.7878 >= 0.0500, removing CNAE_7
p = 0.7904 >= 0.0500, removing CNAE_16
p = 0.7513 >= 0.0500, removing LiqGeral
p = 0.7318 >= 0.0500, removing Porte_2
p = 0.6717 >= 0.0500, removing CNAE_32
p = 0.6074 >= 0.0500, removing IdadedeAnos
p = 0.5522 >= 0.0500, removing IndepFin
p = 0.5347 >= 0.0500, removing CNAE_29
p = 0.5118 >= 0.0500, removing GiroAtivo
p = 0.5066 >= 0.0500, removing CNAE_12
p = 0.5027 >= 0.0500, removing LiqCorrente
p = 0.4883 >= 0.0500, removing CompEndivid
p = 0.3757 >= 0.0500, removing CNAE_15
p = 0.3467 >= 0.0500, removing SolvGeral
p = 0.3076 >= 0.0500, removing ROI
p = 0.2293 >= 0.0500, removing NaturezaJuridica_3
p = 0.1639 >= 0.0500, removing MargOp
p = 0.1271 >= 0.0500, removing ImobRecNC
p = 0.0924 >= 0.0500, removing CNAE_19
p = 0.0656 >= 0.0500, removing EndGeral
p = 0.2087 >= 0.0500, removing ImobilPL
p = 0.1495 >= 0.0500, removing NaturezaJuridica_5
p = 0.2349 >= 0.0500, removing NaturezaJuridica_6
p = 0.0860 >= 0.0500, removing CNAE_18
p = 0.1218 >= 0.0500, removing Porte_3

Logistic regression                                     Number of obs =    762
                                                        LR chi2(14)   = 325.59
                                                        Prob > chi2   = 0.0000
Log likelihood = -365.34015                             Pseudo R2     = 0.3082

--------------------------------------------------------------------------------------
    FoiPenalizadoSTJ | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             Porte_1 |  -1.069392   .3617765    -2.96   0.003    -1.778461   -.3603236
             CNAE_33 |   1.436418   .6432937     2.23   0.026     .1755857    2.697251
             MargLiq |  -1.001208   .3439887    -2.91   0.004    -1.675413   -.3270021
              CNAE_1 |  -1.322174   .2287276    -5.78   0.000    -1.770472   -.8738764
     log_vlrcontrato |     .07998   .0135058     5.92   0.000      .053509     .106451
QtdeCNAEsSecundarios |  -.0172939   .0065184    -2.65   0.008    -.0300698    -.004518
  NaturezaJuridica_4 |  -3.477103   .6240328    -5.57   0.000    -4.700185   -2.254022
             CNAE_30 |   2.808677    .599649     4.68   0.000     1.633386    3.983967
QtePenalOutrosOrgaos |   .0262331   .0052405     5.01   0.000      .015962    .0365042
             CNAE_27 |  -2.000544   .7984473    -2.51   0.012    -3.565472   -.4356157
              CNAE_3 |   4.314845   1.019077     4.23   0.000      2.31749    6.312199
              CNAE_8 |    1.37482   .5311429     2.59   0.010     .3337994    2.415841
             CNAE_23 |   1.024437   .2946676     3.48   0.001     .4468987    1.601975
             CNAE_21 |  -1.798957   .6706848    -2.68   0.007    -3.113475    -.484439
               _cons |  -.1264631   .1914328    -0.66   0.509    -.5016644    .2487382
--------------------------------------------------------------------------------------

. 
. * Armazenar os resultados do modelo stepwise a 5%
. estimates store IRDC05

. 
. * Teste de bondade de ajuste de Hosmer-Lemeshow para o modelo stepwise a 5%
. estat gof if train == 1, group(10) table
note: obs collapsed on 10 quantiles of estimated probabilities.

Goodness-of-fit test after logistic model
Variable: FoiPenalizadoSTJ

  Table collapsed on quantiles of estimated probabilities
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.1319 |     8 |   6.9 |    97 |  98.1 |   105 |
  |     2 | 0.1976 |    24 |  17.1 |    80 |  86.9 |   104 |
  |     3 | 0.3175 |    29 |  27.3 |    75 |  76.7 |   104 |
  |     4 | 0.3802 |    32 |  36.9 |    72 |  67.1 |   104 |
  |     5 | 0.4429 |    42 |  42.4 |    62 |  61.6 |   104 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5200 |    63 |  50.7 |    42 |  54.3 |   105 |
  |     7 | 0.6515 |    71 |  62.2 |    33 |  41.8 |   104 |
  |     8 | 0.7586 |    58 |  72.8 |    46 |  31.2 |   104 |
  |     9 | 0.9179 |    94 |  85.0 |    10 |  19.0 |   104 |
  |    10 | 0.9939 |   100 | 101.1 |     4 |   2.9 |   104 |
  +--------------------------------------------------------+

 Number of observations =  1,042
       Number of groups =     10
Hosmer‚ÄìLemeshow chi2(8) =  29.23
            Prob > chi2 = 0.0003

. 
. 
. /*******************************************************************************
> 6.2.2 Tabela de classifica√ß√£o para o modelo stepwise a 5% na base de treinamento
> *******************************************************************************/
. estat class if train == 1

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |       351            99  |        450
     -     |       170           422  |        592
-----------+--------------------------+-----------
   Total   |       521           521  |       1042

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   67.37%
Specificity                     Pr( -|~D)   81.00%
Positive predictive value       Pr( D| +)   78.00%
Negative predictive value       Pr(~D| -)   71.28%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   19.00%
False - rate for true D         Pr( -| D)   32.63%
False + rate for classified +   Pr(~D| +)   22.00%
False - rate for classified -   Pr( D| -)   28.72%
--------------------------------------------------
Correctly classified                        74.18%
--------------------------------------------------

. 
. * üìå Gerar predi√ß√µes na base de treinamento
. capture drop prob_pred_treino

. predict prob_pred_treino if train == 1, pr
(186 missing values generated)

. 
. * üìå Classifica√ß√£o prevista
. capture drop predicted_class_treino

. gen predicted_class_treino = (prob_pred_treino >= 0.5) if train == 1
(186 missing values generated)

. 
. * üìå Kappa na base de treinamento
. *ssc install kappaetc, replace
. kappaetc FoiPenalizadoSTJ predicted_class_treino if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7418    0.0136  54.69   0.000     0.7152     0.7685
Brennan and Prediger |  0.4837    0.0271  17.83   0.000     0.4305     0.5369
Cohen/Conger's Kappa |  0.4837    0.0269  18.00   0.000     0.4310     0.5364
    Scott/Fleiss' Pi |  0.4813    0.0272  17.67   0.000     0.4278     0.5347
           Gwet's AC |  0.4861    0.0272  17.90   0.000     0.4328     0.5393
Krippendorff's Alpha |  0.4815    0.0272  17.68   0.000     0.4281     0.5350
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de treinamento
. capture drop correct_classification_treino

. gen correct_classification_treino = (FoiPenalizadoSTJ == predicted_class_treino) if train == 1
(186 missing values generated)

. sum correct_classification_treino if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~o |      1,042    .7418426    .4378312          0          1

. scalar prop_modelo_treino = r(mean)

. 
. * üìå No Information Rate (NIR)
. *O NIR representa a acur√°cia de um modelo nulo (baseline), que classifica sempre a categoria mais fr
> equente.
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_treino)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_treino = freq_treino[1,1] + freq_treino[2,1]

. scalar max_treino = max(freq_treino[1,1], freq_treino[2,1])

. scalar prop_nir_treino = max_treino / total_treino

. 
. * üìå Compara√ß√£o
. di "Acur√°cia na base de treinamento: " prop_modelo_treino
Acur√°cia na base de treinamento: .74184261

. di "NIR (treinamento): " prop_nir_treino
NIR (treinamento): .5

. 
. if (prop_modelo_treino > prop_nir_treino) {
.     di "‚úÖ Modelo stepwise 5% supera o NIR na base de treino."
‚úÖ Modelo stepwise 5% supera o NIR na base de treino.
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 5% N√ÉO supera o NIR na base de treino."
. }

. 
. * üìå Teste de McNemar na base de treinamento
. * Criar a matriz de confus√£o da base de teste
. tabulate FoiPenalizadoSTJ predicted_class_treino if train == 1, matcell(mc_treino)

           | predicted_class_trein
FoiPenaliz |           o
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       422         99 |       521 
         1 |       170        351 |       521 
-----------+----------------------+----------
     Total |       592        450 |     1,042 

. 
. * Extrair os valores da matriz
. scalar tn_treino = mc_treino[1,1] // Verdadeiro Negativo

. scalar fn_treino = mc_treino[2,1] // Falso Negativo

. scalar fp_treino = mc_treino[1,2] // Falso Positivo

. scalar tp_treino = mc_treino[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_treino
TN: 422

. di "FN: " fn_treino
FN: 170

. di "FP: " fp_treino
FP: 99

. di "TP: " tp_treino
TP: 351

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_treino' `=fn_treino' `=fp_treino' `=tp_treino'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       422         170  |        592
       Unexposed |        99         351  |        450
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =     18.74    Prob > chi2 = 0.0000
Exact McNemar significance probability       = 0.0000

Proportion with factor
        Cases       .5681382
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference  .0681382      .0366071   .0996693
        ratio       1.136276      1.072374   1.203987
        rel. diff.  .1362764      .0789343   .1936185

        odds ratio  1.717172      1.332505   2.222906   (exact)

. 
. /*******************************************************************************
> 6.2.3 Curva ROC para o modelo stepwise a 5% na base de TREINO
> *******************************************************************************/
. lroc if train == 1

Logistic model for FoiPenalizadoSTJ

Number of observations =     1042
Area under ROC curve   =   0.8113

. graph export "lroc_IRDC05_treino.png", replace
file lroc_IRDC05_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.2.5 Tabela de classifica√ß√£o para o modelo stepwise a 5% na base de TESTE
> *******************************************************************************/
. estat class if train == 0

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        22            19  |         41
     -     |        34           111  |        145
-----------+--------------------------+-----------
   Total   |        56           130  |        186

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   39.29%
Specificity                     Pr( -|~D)   85.38%
Positive predictive value       Pr( D| +)   53.66%
Negative predictive value       Pr(~D| -)   76.55%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   14.62%
False - rate for true D         Pr( -| D)   60.71%
False + rate for classified +   Pr(~D| +)   46.34%
False - rate for classified -   Pr( D| -)   23.45%
--------------------------------------------------
Correctly classified                        71.51%
--------------------------------------------------

. 
. * üìå Gerar predi√ß√µes na base de teste
. capture drop prob_pred_teste

. predict prob_pred_teste if train == 0, pr
(1,042 missing values generated)

. 
. * üìå Classifica√ß√£o prevista
. capture drop predicted_class_teste

. gen predicted_class_teste = (prob_pred_teste >= 0.5) if train == 0
(1,042 missing values generated)

. 
. * üìå Kappa na base de teste
. kappaetc FoiPenalizadoSTJ predicted_class_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7151    0.0332  21.55   0.000     0.6496     0.7805
Brennan and Prediger |  0.4301    0.0664   6.48   0.000     0.2992     0.5611
Cohen/Conger's Kappa |  0.2671    0.0765   3.49   0.001     0.1161     0.4180
    Scott/Fleiss' Pi |  0.2609    0.0782   3.34   0.001     0.1066     0.4151
           Gwet's AC |  0.5363    0.0642   8.35   0.000     0.4096     0.6630
Krippendorff's Alpha |  0.2629    0.0782   3.36   0.001     0.1086     0.4171
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de teste
. capture drop correct_classification_teste

. gen correct_classification_teste = (FoiPenalizadoSTJ == predicted_class_teste) if train == 0
(1,042 missing values generated)

. sum correct_classification_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~e |        186    .7150538    .4526072          0          1

. scalar prop_modelo_teste = r(mean)

. 
. * üìå No Information Rate (NIR)
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar prop_nir_teste = max_teste / total_teste

. 
. 
. * üìå Compara√ß√£o
. di "Acur√°cia na base de teste: " prop_modelo_teste
Acur√°cia na base de teste: .71505376

. di "NIR (teste): " prop_nir_teste
NIR (teste): .69892473

. 
. if (prop_modelo_teste > prop_nir_teste) {
.     di "‚úÖ Modelo stepwise 5% supera o NIR na base de teste."
‚úÖ Modelo stepwise 5% supera o NIR na base de teste.
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 5% N√ÉO supera o NIR na base de teste."
. }

. 
. * üìå Teste de McNemar na base de teste
. * Criar a matriz de confus√£o da base de teste
. tabulate FoiPenalizadoSTJ predicted_class_teste if train == 0, matcell(mc_teste)

FoiPenaliz | predicted_class_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       111         19 |       130 
         1 |        34         22 |        56 
-----------+----------------------+----------
     Total |       145         41 |       186 

. 
. * Extrair os valores da matriz
. scalar tn_teste = mc_teste[1,1] // Verdadeiro Negativo

. scalar fn_teste = mc_teste[2,1] // Falso Negativo

. scalar fp_teste = mc_teste[1,2] // Falso Positivo

. scalar tp_teste = mc_teste[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_teste
TN: 111

. di "FN: " fn_teste
FN: 34

. di "FP: " fp_teste
FP: 19

. di "TP: " tp_teste
TP: 22

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       111          34  |        145
       Unexposed |        19          22  |         41
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =      4.25    Prob > chi2 = 0.0394
Exact McNemar significance probability       = 0.0534

Proportion with factor
        Cases       .7795699
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference  .0806452     -.0005644   .1618547
        ratio       1.115385      1.005286   1.237542
        rel. diff.  .2678571      .0498374   .4858769

        odds ratio  1.789474      .9921637   3.320943   (exact)

. 
. /*******************************************************************************
> 6.2.6 Curva ROC para o modelo stepwise a 5% na base de TESTE
> *******************************************************************************/
. lroc if train == 0

Logistic model for FoiPenalizadoSTJ

Number of observations =      186
Area under ROC curve   =   0.7335

. graph export "lroc_IRDC05_teste.png", replace
file lroc_IRDC05_teste.png saved as PNG format

. 
. /*******************************************************************************
> 6.2.7 ‚Äì Ponto de Corte Ideal (Sensibilidade ‚âà Especificidade)
> *******************************************************************************/
. 
. * Reexecutar rapidamente o modelo (sem sobrescrever)
. quietly logit FoiPenalizadoSTJ `var_contabeis' `var_controle' if train == 1

. 
. * Restaurar modelo salvo
. estimates restore IRDC05
(results IRDC05 are active now)

. 
. * üìå BASE DE TREINAMENTO
. * ------------------------------------------------------------
. * Garantir que as vari√°veis tempor√°rias n√£o existam
. capture drop prob_pred_treino

. capture drop cutoff

. capture drop sens

. capture drop spec

. capture drop difference

. capture drop abs_diff

. capture drop ordem

. 
. * Gerar predi√ß√µes
. predict prob_pred_treino if train == 1, pr
(186 missing values generated)

. 
. * Gerar sensitividade e especificidade para diferentes cutoffs
. lsens if train == 1, genprob(cutoff) gensens(sens) genspec(spec) nograph

. 
. * Calcular diferen√ßa entre sensibilidade e especificidade
. gen difference = sens - spec
(212 missing values generated)

. gen abs_diff = abs(difference)
(212 missing values generated)

. 
. * Obter ponto ideal (menor diferen√ßa)
. gen ordem = _n

. gsort abs_diff

. 
. * Salvar valores do melhor ponto em scalars usando summarize
. summarize cutoff if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      cutoff |          1    .4433468           .   .4433468   .4433468

. scalar cutoff_ideal_treino = r(mean)

. scalar cutoff_step05 = cutoff_ideal_treino

. 
. 
. summarize sens if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        sens |          1    .7408829           .   .7408829   .7408829

. scalar sens_ideal_treino = r(mean)

. 
. summarize spec if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        spec |          1    .7408829           .   .7408829   .7408829

. scalar spec_ideal_treino = r(mean)

. 
. * Mostrar o ponto ideal encontrado
. list cutoff sens spec abs_diff in 1, noobs clean

      cutoff       sens       spec   abs_diff  
    0.443347   0.740883   0.740883   5.96e-08  

. 
. * Plotar gr√°fico com destaque no ponto de cruzamento
. lsens if train == 1, ///
>     yline(`=sens_ideal_treino') xline(`=cutoff_ideal_treino') ///
>     scheme(s1color) ///
>     ylab(0 0.2 `=sens_ideal_treino' 0.8 1) ///
>     xlab(0 0.2 `=cutoff_ideal_treino' 0.8 1)

. 
. graph export "cutoff_ideal_IRDC05_treino.png", replace
file cutoff_ideal_IRDC05_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.2.8 ‚Äì Tabela de Classifica√ß√£o com Cutoff Ideal (Treinamento e Teste)
> *******************************************************************************/
. 
. * üìå BASE DE TREINAMENTO
. * ------------------------------------------------------------
. 
. di "Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO: " cutoff_ideal_treino
Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO: .44334681

. 
. * Gerar classifica√ß√£o com o cutoff ideal
. capture drop predicted_class_treino

. gen predicted_class_treino = (prob_pred_treino >= cutoff_ideal_treino) if train == 1
(186 missing values generated)

. 
. * Matriz de classifica√ß√£o detalhada
. estat class if train == 1

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |       351            99  |        450
     -     |       170           422  |        592
-----------+--------------------------+-----------
   Total   |       521           521  |       1042

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   67.37%
Specificity                     Pr( -|~D)   81.00%
Positive predictive value       Pr( D| +)   78.00%
Negative predictive value       Pr(~D| -)   71.28%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   19.00%
False - rate for true D         Pr( -| D)   32.63%
False + rate for classified +   Pr(~D| +)   22.00%
False - rate for classified -   Pr( D| -)   28.72%
--------------------------------------------------
Correctly classified                        74.18%
--------------------------------------------------

. 
. * Kappa
. kappaetc FoiPenalizadoSTJ predicted_class_treino if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7399    0.0136  54.42   0.000     0.7132     0.7666
Brennan and Prediger |  0.4798    0.0272  17.65   0.000     0.4265     0.5332
Cohen/Conger's Kappa |  0.4798    0.0272  17.65   0.000     0.4265     0.5332
    Scott/Fleiss' Pi |  0.4798    0.0272  17.65   0.000     0.4265     0.5332
           Gwet's AC |  0.4798    0.0272  17.65   0.000     0.4265     0.5332
Krippendorff's Alpha |  0.4801    0.0272  17.66   0.000     0.4267     0.5335
------------------------------------------------------------------------------

. 
. * Acur√°cia
. capture drop correct_classification_treino

. gen correct_classification_treino = (FoiPenalizadoSTJ == predicted_class_treino) if train == 1
(186 missing values generated)

. sum correct_classification_treino if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~o |      1,042    .7399232    .4388869          0          1

. scalar prop_modelo_treino = r(mean)

. 
. * No Information Rate
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_treino)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_treino = freq_treino[1,1] + freq_treino[2,1]

. scalar max_treino = max(freq_treino[1,1], freq_treino[2,1])

. scalar prop_nir_treino = max_treino / total_treino

. 
. di "Acur√°cia (treino): " prop_modelo_treino
Acur√°cia (treino): .73992322

. di "NIR (treino): " prop_nir_treino
NIR (treino): .5

. 
. if (prop_modelo_treino > prop_nir_treino) {
.     di "‚úÖ Modelo stepwise 5% supera o NIR na base de treino (cutoff ideal)."
‚úÖ Modelo stepwise 5% supera o NIR na base de treino (cutoff ideal).
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 5% N√ÉO supera o NIR na base de treino (cutoff ideal)."
. }

. 
. * Teste de McNemar
. tabulate FoiPenalizadoSTJ predicted_class_treino if train == 1, matcell(mc_treino)

           | predicted_class_trein
FoiPenaliz |           o
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       386        135 |       521 
         1 |       136        385 |       521 
-----------+----------------------+----------
     Total |       522        520 |     1,042 

. scalar tn_treino = mc_treino[1,1]

. scalar fn_treino = mc_treino[2,1]

. scalar fp_treino = mc_treino[1,2]

. scalar tp_treino = mc_treino[2,2]

. mcci `=tn_treino' `=fn_treino' `=fp_treino' `=tp_treino'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       386         136  |        522
       Unexposed |       135         385  |        520
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =      0.00    Prob > chi2 = 0.9516
Exact McNemar significance probability       = 1.0000

Proportion with factor
        Cases       .5009597
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference  .0009597     -.0309645   .0328839
        ratio       1.001919      .9418095   1.065866
        rel. diff.  .0019194     -.0599503   .0637891

        odds ratio  1.007407      .7880613    1.28788   (exact)

. 
. 
. * üìå BASE DE TESTE
. * ------------------------------------------------------------
. 
. di "Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO (aplicado na base de TE
> STE): " cutoff_ideal_treino
Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO (aplicado na base de TESTE): 
> .44334681

. 
. * Gerar classifica√ß√£o com o mesmo cutoff da base de teste
. capture drop predicted_class_teste

. gen predicted_class_teste = (prob_pred_teste >= cutoff_ideal_treino) if train == 0
(1,042 missing values generated)

. 
. * Matriz de classifica√ß√£o detalhada
. estat class if train == 0

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        22            19  |         41
     -     |        34           111  |        145
-----------+--------------------------+-----------
   Total   |        56           130  |        186

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   39.29%
Specificity                     Pr( -|~D)   85.38%
Positive predictive value       Pr( D| +)   53.66%
Negative predictive value       Pr(~D| -)   76.55%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   14.62%
False - rate for true D         Pr( -| D)   60.71%
False + rate for classified +   Pr(~D| +)   46.34%
False - rate for classified -   Pr( D| -)   23.45%
--------------------------------------------------
Correctly classified                        71.51%
--------------------------------------------------

. 
. * Kappa
. kappaetc FoiPenalizadoSTJ predicted_class_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7151    0.0332  21.55   0.000     0.6496     0.7805
Brennan and Prediger |  0.4301    0.0664   6.48   0.000     0.2992     0.5611
Cohen/Conger's Kappa |  0.3195    0.0750   4.26   0.000     0.1716     0.4674
    Scott/Fleiss' Pi |  0.3195    0.0750   4.26   0.000     0.1715     0.4674
           Gwet's AC |  0.5098    0.0658   7.75   0.000     0.3800     0.6396
Krippendorff's Alpha |  0.3213    0.0750   4.29   0.000     0.1734     0.4692
------------------------------------------------------------------------------

. 
. * Acur√°cia
. capture drop correct_classification_teste

. gen correct_classification_teste = (FoiPenalizadoSTJ == predicted_class_teste) if train == 0
(1,042 missing values generated)

. sum correct_classification_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~e |        186    .7150538    .4526072          0          1

. scalar prop_modelo_teste = r(mean)

. 
. * No Information Rate
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar prop_nir_teste = max_teste / total_teste

. 
. di "Acur√°cia (teste): " prop_modelo_teste
Acur√°cia (teste): .71505376

. di "NIR (teste): " prop_nir_teste
NIR (teste): .69892473

. 
. if (prop_modelo_teste > prop_nir_teste) {
.     di "‚úÖ Modelo stepwise 5% supera o NIR na base de teste (cutoff ideal do treino)."
‚úÖ Modelo stepwise 5% supera o NIR na base de teste (cutoff ideal do treino).
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 5% N√ÉO supera o NIR na base de teste (cutoff ideal do treino)."
. }

. 
. * Teste de McNemar
. tabulate FoiPenalizadoSTJ predicted_class_teste if train == 0, matcell(mc_teste)

FoiPenaliz | predicted_class_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       104         26 |       130 
         1 |        27         29 |        56 
-----------+----------------------+----------
     Total |       131         55 |       186 

. scalar tn_teste = mc_teste[1,1]

. scalar fn_teste = mc_teste[2,1]

. scalar fp_teste = mc_teste[1,2]

. scalar tp_teste = mc_teste[2,2]

. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       104          27  |        131
       Unexposed |        26          29  |         55
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =      0.02    Prob > chi2 = 0.8907
Exact McNemar significance probability       = 1.0000

Proportion with factor
        Cases       .7043011
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference  .0053763     -.0767098   .0874625
        ratio       1.007692      .9033212   1.124123
        rel. diff.  .0178571     -.2346568   .2703711

        odds ratio  1.038462       .583269   1.852103   (exact)

. 
. /*******************************************************************************
> 6.3 Regress√£o log√≠stica com sele√ß√£o stepwise a 10% de signific√¢ncia no conjunto de treinamento
> *******************************************************************************/
. * Capturar todas as vari√°veis que come√ßam com "Porte_"
. unab Porte_vars : Porte_*

. 
. * Capturar todas as vari√°veis que come√ßam com "CNAE_"
. unab CNAE_vars : CNAE_*

. 
. * Capturar todas as vari√°veis que come√ßam com "NaturezaJuridica_"
. unab Natureza_vars : NaturezaJuridica_*

. 
. * Definir vari√°veis cont√°beis e de controle corretamente
. local var_contabeis `Porte_vars' LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid Ind
> epFin ImobilPL ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE

. 
. *local var_controle `CNAE_vars' `Natureza_vars' log_vlrcontrato qtdecnaess~s idadedeanos qtepenalou~
> s
. 
. local var_controle `CNAE_vars' `Natureza_vars' log_vlrcon~o  QtdeCNAEsS~s IdadedeAnos QtePenalOu~s

. 
. *Regress√£o log√≠stica com sele√ß√£o stepwise a 10% 
. sw, pr(.10): logit FoiPenalizadoSTJ `var_contabeis' `var_controle' if train == 1
note: Porte_4 omitted because of estimability.
note: PtpCapTerce omitted because of estimability.
note: CNAE_2 omitted because of estimability.
note: CNAE_4 omitted because of estimability.
note: CNAE_6 omitted because of estimability.
note: CNAE_9 omitted because of estimability.
note: CNAE_10 omitted because of estimability.
note: CNAE_11 omitted because of estimability.
note: CNAE_14 omitted because of estimability.
note: CNAE_20 omitted because of estimability.
note: CNAE_22 omitted because of estimability.
note: CNAE_24 omitted because of estimability.
note: CNAE_25 omitted because of estimability.
note: CNAE_26 omitted because of estimability.
note: CNAE_28 omitted because of estimability.
note: CNAE_31 omitted because of estimability.
note: CNAE_34 omitted because of estimability.
note: CNAE_35 omitted because of estimability.
note: CNAE_36 omitted because of estimability.
note: CNAE_37 omitted because of estimability.
note: CNAE_38 omitted because of estimability.
note: o.NaturezaJuridica_1 omitted because of estimability.
note: NaturezaJuridica_2 omitted because of estimability.
note: NaturezaJuridica_7 omitted because of estimability.
note: NaturezaJuridica_8 omitted because of estimability.
note: NaturezaJuridica_9 omitted because of estimability.
note: NaturezaJuridica_10 omitted because of estimability.
note: 280 obs omitted because of estimability.

Wald test, begin with full model:
p = 0.9918 >= 0.1000, removing CNAE_17
p = 0.9388 >= 0.1000, removing CNAE_5
p = 0.8695 >= 0.1000, removing ROE
p = 0.8520 >= 0.1000, removing CNAE_13
p = 0.8240 >= 0.1000, removing LiqCorAjust
p = 0.7878 >= 0.1000, removing CNAE_7
p = 0.7904 >= 0.1000, removing CNAE_16
p = 0.7513 >= 0.1000, removing LiqGeral
p = 0.7318 >= 0.1000, removing Porte_2
p = 0.6717 >= 0.1000, removing CNAE_32
p = 0.6074 >= 0.1000, removing IdadedeAnos
p = 0.5522 >= 0.1000, removing IndepFin
p = 0.5347 >= 0.1000, removing CNAE_29
p = 0.5118 >= 0.1000, removing GiroAtivo
p = 0.5066 >= 0.1000, removing CNAE_12
p = 0.5027 >= 0.1000, removing LiqCorrente
p = 0.4883 >= 0.1000, removing CompEndivid
p = 0.3757 >= 0.1000, removing CNAE_15
p = 0.3467 >= 0.1000, removing SolvGeral
p = 0.3076 >= 0.1000, removing ROI
p = 0.2293 >= 0.1000, removing NaturezaJuridica_3
p = 0.1639 >= 0.1000, removing MargOp
p = 0.1271 >= 0.1000, removing ImobRecNC

Logistic regression                                     Number of obs =    762
                                                        LR chi2(21)   = 343.10
                                                        Prob > chi2   = 0.0000
Log likelihood = -356.58779                             Pseudo R2     = 0.3248

--------------------------------------------------------------------------------------
    FoiPenalizadoSTJ | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             Porte_1 |  -1.320665   .3927635    -3.36   0.001    -2.090467   -.5508623
             CNAE_33 |   1.526525   .6720029     2.27   0.023     .2094234    2.843626
             Porte_3 |  -.7687474   .3770924    -2.04   0.041    -1.507835     -.02966
             CNAE_19 |  -.9931945    .590236    -1.68   0.092    -2.150036    .1636469
     log_vlrcontrato |   .0715372   .0139581     5.13   0.000     .0441798    .0988947
  NaturezaJuridica_6 |  -2.171917   1.050704    -2.07   0.039    -4.231259   -.1125752
  NaturezaJuridica_4 |     -4.836   .9618037    -5.03   0.000      -6.7211   -2.950899
            EndGeral |   .0958537   .0479038     2.00   0.045      .001964    .1897434
             CNAE_18 |   1.771536   .9100626     1.95   0.052     -.012154    3.555226
             CNAE_27 |  -1.826282   .8060671    -2.27   0.023    -3.406144   -.2464192
            ImobilPL |  -.5642994    .265274    -2.13   0.033    -1.084227    -.044372
              CNAE_8 |   1.276059   .5346822     2.39   0.017     .2281012    2.324017
             CNAE_23 |   .9818773   .3016632     3.25   0.001     .3906283    1.573126
             CNAE_21 |  -1.783108   .6737839    -2.65   0.008      -3.1037   -.4625156
             MargLiq |  -1.022316   .3524313    -2.90   0.004    -1.713068    -.331563
QtePenalOutrosOrgaos |    .031828   .0060123     5.29   0.000      .020044    .0436119
QtdeCNAEsSecundarios |  -.0164641   .0066726    -2.47   0.014    -.0295422   -.0033861
              CNAE_1 |  -1.275989   .2397143    -5.32   0.000     -1.74582   -.8061572
              CNAE_3 |    4.68477   1.038567     4.51   0.000     2.649217    6.720323
             CNAE_30 |   2.812147   .6279816     4.48   0.000     1.581326    4.042968
  NaturezaJuridica_5 |  -1.304601   .7005161    -1.86   0.063    -2.677587    .0683854
               _cons |   1.281909   .7257902     1.77   0.077    -.1406141    2.704431
--------------------------------------------------------------------------------------

. 
. * Armazenar os resultados do modelo stepwise a 10%
. estimates store IRDC10

. 
. * Teste de bondade de ajuste de Hosmer-Lemeshow para o modelo stepwise a 10%
. estat gof if train == 1, group(10) table
note: obs collapsed on 10 quantiles of estimated probabilities.

Goodness-of-fit test after logistic model
Variable: FoiPenalizadoSTJ

  Table collapsed on quantiles of estimated probabilities
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.1189 |    12 |   6.0 |    93 |  99.0 |   105 |
  |     2 | 0.1949 |    21 |  16.4 |    83 |  87.6 |   104 |
  |     3 | 0.3001 |    24 |  25.3 |    80 |  78.7 |   104 |
  |     4 | 0.3875 |    30 |  36.4 |    74 |  67.6 |   104 |
  |     5 | 0.4549 |    51 |  44.0 |    53 |  60.0 |   104 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5532 |    51 |  52.9 |    54 |  52.1 |   105 |
  |     7 | 0.6645 |    80 |  62.9 |    24 |  41.1 |   104 |
  |     8 | 0.7652 |    61 |  74.2 |    43 |  29.8 |   104 |
  |     9 | 0.9341 |    91 |  86.1 |    13 |  17.9 |   104 |
  |    10 | 0.9961 |   100 | 101.5 |     4 |   2.5 |   104 |
  +--------------------------------------------------------+

 Number of observations =  1,042
       Number of groups =     10
Hosmer‚ÄìLemeshow chi2(8) =  34.33
            Prob > chi2 = 0.0000

. 
. /*******************************************************************************
> 6.3.2 Tabela de classifica√ß√£o para o modelo stepwise a 10% na base de treinamento
> *******************************************************************************/
. estat class if train == 1

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |       362           110  |        472
     -     |       159           411  |        570
-----------+--------------------------+-----------
   Total   |       521           521  |       1042

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   69.48%
Specificity                     Pr( -|~D)   78.89%
Positive predictive value       Pr( D| +)   76.69%
Negative predictive value       Pr(~D| -)   72.11%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   21.11%
False - rate for true D         Pr( -| D)   30.52%
False + rate for classified +   Pr(~D| +)   23.31%
False - rate for classified -   Pr( D| -)   27.89%
--------------------------------------------------
Correctly classified                        74.18%
--------------------------------------------------

. 
. * üìå Gerar predi√ß√µes na base de treinamento
. capture drop prob_pred_treino

. predict prob_pred_treino if train == 1, pr
(186 missing values generated)

. 
. * üìå Classifica√ß√£o prevista
. capture drop predicted_class_treino

. gen predicted_class_treino = (prob_pred_treino >= 0.5) if train == 1
(186 missing values generated)

. 
. * üìå Kappa na base de treinamento
. *ssc install kappaetc, replace
. kappaetc FoiPenalizadoSTJ predicted_class_treino if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7418    0.0136  54.69   0.000     0.7152     0.7685
Brennan and Prediger |  0.4837    0.0271  17.83   0.000     0.4305     0.5369
Cohen/Conger's Kappa |  0.4837    0.0270  17.91   0.000     0.4307     0.5367
    Scott/Fleiss' Pi |  0.4825    0.0272  17.76   0.000     0.4292     0.5359
           Gwet's AC |  0.4848    0.0271  17.86   0.000     0.4316     0.5381
Krippendorff's Alpha |  0.4828    0.0272  17.77   0.000     0.4295     0.5361
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de treinamento
. capture drop correct_classification_treino

. gen correct_classification_treino = (FoiPenalizadoSTJ == predicted_class_treino) if train == 1
(186 missing values generated)

. sum correct_classification_treino if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~o |      1,042    .7418426    .4378312          0          1

. scalar prop_modelo_treino = r(mean)

. 
. * üìå No Information Rate (NIR)
. *O NIR representa a acur√°cia de um modelo nulo (baseline), que classifica sempre a categoria mais fr
> equente.
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_treino)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_treino = freq_treino[1,1] + freq_treino[2,1]

. scalar max_treino = max(freq_treino[1,1], freq_treino[2,1])

. scalar prop_nir_treino = max_treino / total_treino

. 
. * üìå Compara√ß√£o
. di "Acur√°cia na base de treinamento: " prop_modelo_treino
Acur√°cia na base de treinamento: .74184261

. di "NIR (treinamento): " prop_nir_treino
NIR (treinamento): .5

. 
. if (prop_modelo_treino > prop_nir_treino) {
.     di "‚úÖ Modelo stepwise 10% supera o NIR na base de treino."
‚úÖ Modelo stepwise 10% supera o NIR na base de treino.
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 10% N√ÉO supera o NIR na base de treino."
. }

. 
. * üìå Teste de McNemar na base de treinamento
. * Criar a matriz de confus√£o da base de teste
. tabulate FoiPenalizadoSTJ predicted_class_treino if train == 1, matcell(mc_treino)

           | predicted_class_trein
FoiPenaliz |           o
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       411        110 |       521 
         1 |       159        362 |       521 
-----------+----------------------+----------
     Total |       570        472 |     1,042 

. 
. * Extrair os valores da matriz
. scalar tn_treino = mc_treino[1,1] // Verdadeiro Negativo

. scalar fn_treino = mc_treino[2,1] // Falso Negativo

. scalar fp_treino = mc_treino[1,2] // Falso Positivo

. scalar tp_treino = mc_treino[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_treino
TN: 411

. di "FN: " fn_treino
FN: 159

. di "FP: " fp_treino
FP: 110

. di "TP: " tp_treino
TP: 362

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_treino' `=fn_treino' `=fp_treino' `=tp_treino'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       411         159  |        570
       Unexposed |       110         362  |        472
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =      8.93    Prob > chi2 = 0.0028
Exact McNemar significance probability       = 0.0034

Proportion with factor
        Cases        .547025
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference   .047025      .0153476   .0787023
        ratio        1.09405       1.03138   1.160528
        rel. diff.  .0940499      .0353228    .152777

        odds ratio  1.445455      1.126448   1.860365   (exact)

. 
. /*******************************************************************************
> 6.3.3 Curva ROC para o modelo stepwise a 10% na base de TREINO
> *******************************************************************************/
. lroc if train == 1

Logistic model for FoiPenalizadoSTJ

Number of observations =     1042
Area under ROC curve   =   0.8150

. graph export "lroc_IRDC10_treino.png", replace
file lroc_IRDC10_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.3.4 Tabela de classifica√ß√£o para o modelo stepwise a 10% na base de TESTE
> *******************************************************************************/
. estat class if train == 0

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        30            19  |         49
     -     |        26           111  |        137
-----------+--------------------------+-----------
   Total   |        56           130  |        186

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   53.57%
Specificity                     Pr( -|~D)   85.38%
Positive predictive value       Pr( D| +)   61.22%
Negative predictive value       Pr(~D| -)   81.02%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   14.62%
False - rate for true D         Pr( -| D)   46.43%
False + rate for classified +   Pr(~D| +)   38.78%
False - rate for classified -   Pr( D| -)   18.98%
--------------------------------------------------
Correctly classified                        75.81%
--------------------------------------------------

. 
. * üìå Gerar predi√ß√µes na base de teste
. capture drop prob_pred_teste

. predict prob_pred_teste if train == 0, pr
(1,042 missing values generated)

. 
. * üìå Classifica√ß√£o prevista
. capture drop predicted_class_teste

. gen predicted_class_teste = (prob_pred_teste >= 0.5) if train == 0
(1,042 missing values generated)

. 
. * üìå Kappa na base de teste
. kappaetc FoiPenalizadoSTJ predicted_class_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7581    0.0315  24.08   0.000     0.6959     0.8202
Brennan and Prediger |  0.5161    0.0630   8.20   0.000     0.3919     0.6404
Cohen/Conger's Kappa |  0.4039    0.0738   5.47   0.000     0.2583     0.5495
    Scott/Fleiss' Pi |  0.4029    0.0742   5.43   0.000     0.2566     0.5492
           Gwet's AC |  0.5933    0.0604   9.83   0.000     0.4742     0.7124
Krippendorff's Alpha |  0.4045    0.0742   5.45   0.000     0.2582     0.5508
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de teste
. capture drop correct_classification_teste

. gen correct_classification_teste = (FoiPenalizadoSTJ == predicted_class_teste) if train == 0
(1,042 missing values generated)

. sum correct_classification_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~e |        186    .7580645    .4294113          0          1

. scalar prop_modelo_teste = r(mean)

. 
. * üìå No Information Rate (NIR)
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar prop_nir_teste = max_teste / total_teste

. 
. 
. * üìå Compara√ß√£o
. di "Acur√°cia na base de teste: " prop_modelo_teste
Acur√°cia na base de teste: .75806452

. di "NIR (teste): " prop_nir_teste
NIR (teste): .69892473

. 
. if (prop_modelo_teste > prop_nir_teste) {
.     di "‚úÖ Modelo stepwise 10% supera o NIR na base de teste."
‚úÖ Modelo stepwise 10% supera o NIR na base de teste.
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 10% N√ÉO supera o NIR na base de teste."
. }

. 
. * üìå Teste de McNemar na base de teste
. * Criar a matriz de confus√£o da base de teste
. tabulate FoiPenalizadoSTJ predicted_class_teste if train == 0, matcell(mc_teste)

FoiPenaliz | predicted_class_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       111         19 |       130 
         1 |        26         30 |        56 
-----------+----------------------+----------
     Total |       137         49 |       186 

. 
. * Extrair os valores da matriz
. scalar tn_teste = mc_teste[1,1] // Verdadeiro Negativo

. scalar fn_teste = mc_teste[2,1] // Falso Negativo

. scalar fp_teste = mc_teste[1,2] // Falso Positivo

. scalar tp_teste = mc_teste[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_teste
TN: 111

. di "FN: " fn_teste
FN: 26

. di "FP: " fp_teste
FP: 19

. di "TP: " tp_teste
TP: 30

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       111          26  |        137
       Unexposed |        19          30  |         49
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =      1.09    Prob > chi2 = 0.2967
Exact McNemar significance probability       = 0.3713

Proportion with factor
        Cases       .7365591
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference  .0376344      -.038222   .1134908
        ratio       1.053846      .9549722   1.162957
        rel. diff.      .125     -.0946192   .3446192

        odds ratio  1.368421      .7286183    2.61576   (exact)

. 
. /*******************************************************************************
> 6.3.5 Curva ROC para o modelo stepwise a 10% na base de TESTE
> *******************************************************************************/
. lroc if train == 0

Logistic model for FoiPenalizadoSTJ

Number of observations =      186
Area under ROC curve   =   0.7159

. graph export "lroc_IRDC10_teste.png", replace
file lroc_IRDC10_teste.png saved as PNG format

. 
. /*******************************************************************************
> 6.3.6 ‚Äì Ponto de Corte Ideal (Sensibilidade ‚âà Especificidade)
> *******************************************************************************/
. 
. * Reexecutar rapidamente o modelo (sem sobrescrever)
. quietly logit FoiPenalizadoSTJ `var_contabeis' `var_controle' if train == 1

. 
. * Restaurar modelo salvo
. estimates restore IRDC10
(results IRDC10 are active now)

. 
. * üìå BASE DE TREINAMENTO
. * ------------------------------------------------------------
. * Garantir que as vari√°veis tempor√°rias n√£o existam
. capture drop prob_pred_treino

. capture drop cutoff

. capture drop sens

. capture drop spec

. capture drop difference

. capture drop abs_diff

. capture drop ordem

. 
. * Gerar predi√ß√µes
. predict prob_pred_treino if train == 1, pr
(186 missing values generated)

. 
. * Gerar sensitividade e especificidade para diferentes cutoffs
. lsens if train == 1, genprob(cutoff) gensens(sens) genspec(spec) nograph

. 
. * Calcular diferen√ßa entre sensibilidade e especificidade
. gen difference = sens - spec
(187 missing values generated)

. gen abs_diff = abs(difference)
(187 missing values generated)

. 
. * Obter ponto ideal (menor diferen√ßa)
. gen ordem = _n

. gsort abs_diff

. 
. * Salvar valores do melhor ponto em scalars usando summarize
. summarize cutoff if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      cutoff |          1    .4552629           .   .4552629   .4552629

. scalar cutoff_ideal_treino = r(mean)

. 
. summarize sens if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        sens |          1    .7351248           .   .7351248   .7351248

. scalar sens_ideal_treino = r(mean)

. scalar cutoff_step10 = cutoff_ideal_treino

. 
. 
. summarize spec if abs_diff == abs_diff[1]

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        spec |          1    .7351248           .   .7351248   .7351248

. scalar spec_ideal_treino = r(mean)

. 
. * Mostrar o ponto ideal encontrado
. list cutoff sens spec abs_diff in 1, noobs clean

      cutoff       sens       spec   abs_diff  
    0.455263   0.735125   0.735125          0  

. 
. * Plotar gr√°fico com destaque no ponto de cruzamento
. lsens if train == 1, ///
>     yline(`=sens_ideal_treino') xline(`=cutoff_ideal_treino') ///
>     scheme(s1color) ///
>     ylab(0 0.2 `=sens_ideal_treino' 0.8 1) ///
>     xlab(0 0.2 `=cutoff_ideal_treino' 0.8 1)

. 
. graph export "cutoff_ideal_IRDC10_treino.png", replace
file cutoff_ideal_IRDC10_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.3.7 ‚Äì Tabela de Classifica√ß√£o com Cutoff Ideal (Treinamento e Teste)
> *******************************************************************************/
. 
. * üìå BASE DE TREINAMENTO
. * ------------------------------------------------------------
. 
. di "Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO: " cutoff_ideal_treino
Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO: .45526294

. 
. * Gerar classifica√ß√£o com o cutoff ideal
. capture drop predicted_class_treino

. gen predicted_class_treino = (prob_pred_treino >= cutoff_ideal_treino) if train == 1
(186 missing values generated)

. 
. * Matriz de classifica√ß√£o detalhada
. estat class if train == 1

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |       362           110  |        472
     -     |       159           411  |        570
-----------+--------------------------+-----------
   Total   |       521           521  |       1042

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   69.48%
Specificity                     Pr( -|~D)   78.89%
Positive predictive value       Pr( D| +)   76.69%
Negative predictive value       Pr(~D| -)   72.11%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   21.11%
False - rate for true D         Pr( -| D)   30.52%
False + rate for classified +   Pr(~D| +)   23.31%
False - rate for classified -   Pr( D| -)   27.89%
--------------------------------------------------
Correctly classified                        74.18%
--------------------------------------------------

. 
. * Kappa
. kappaetc FoiPenalizadoSTJ predicted_class_treino if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7361    0.0137  53.88   0.000     0.7093     0.7629
Brennan and Prediger |  0.4722    0.0273  17.28   0.000     0.4186     0.5258
Cohen/Conger's Kappa |  0.4722    0.0273  17.28   0.000     0.4186     0.5258
    Scott/Fleiss' Pi |  0.4722    0.0273  17.28   0.000     0.4186     0.5258
           Gwet's AC |  0.4722    0.0273  17.28   0.000     0.4186     0.5258
Krippendorff's Alpha |  0.4724    0.0273  17.29   0.000     0.4188     0.5260
------------------------------------------------------------------------------

. 
. * Acur√°cia
. capture drop correct_classification_treino

. gen correct_classification_treino = (FoiPenalizadoSTJ == predicted_class_treino) if train == 1
(186 missing values generated)

. sum correct_classification_treino if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~o |      1,042    .7360845    .4409657          0          1

. scalar prop_modelo_treino = r(mean)

. 
. * No Information Rate
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_treino)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_treino = freq_treino[1,1] + freq_treino[2,1]

. scalar max_treino = max(freq_treino[1,1], freq_treino[2,1])

. scalar prop_nir_treino = max_treino / total_treino

. 
. di "Acur√°cia (treino): " prop_modelo_treino
Acur√°cia (treino): .73608445

. di "NIR (treino): " prop_nir_treino
NIR (treino): .5

. 
. if (prop_modelo_treino > prop_nir_treino) {
.     di "‚úÖ Modelo stepwise 10% supera o NIR na base de treino (cutoff ideal)."
‚úÖ Modelo stepwise 10% supera o NIR na base de treino (cutoff ideal).
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 10% N√ÉO supera o NIR na base de treino (cutoff ideal)."
. }

. 
. * Teste de McNemar
. tabulate FoiPenalizadoSTJ predicted_class_treino if train == 1, matcell(mc_treino)

           | predicted_class_trein
FoiPenaliz |           o
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       384        137 |       521 
         1 |       138        383 |       521 
-----------+----------------------+----------
     Total |       522        520 |     1,042 

. scalar tn_treino = mc_treino[1,1]

. scalar fn_treino = mc_treino[2,1]

. scalar fp_treino = mc_treino[1,2]

. scalar tp_treino = mc_treino[2,2]

. mcci `=tn_treino' `=fn_treino' `=fp_treino' `=tp_treino'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       384         138  |        522
       Unexposed |       137         383  |        520
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =      0.00    Prob > chi2 = 0.9519
Exact McNemar significance probability       = 1.0000

Proportion with factor
        Cases       .5009597
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference  .0009597     -.0311922   .0331116
        ratio       1.001919      .9413812   1.066351
        rel. diff.  .0019194     -.0604052    .064244

        odds ratio  1.007299      .7894332   1.285364   (exact)

. 
. 
. * üìå BASE DE TESTE
. * ------------------------------------------------------------
. 
. di "Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO (aplicado na base de TE
> STE): " cutoff_ideal_treino
Tabela de classifica√ß√£o utilizando o cutoff ideal da base de TREINAMENTO (aplicado na base de TESTE): 
> .45526294

. 
. * Gerar classifica√ß√£o com o mesmo cutoff da base de teste
. capture drop predicted_class_teste

. gen predicted_class_teste = (prob_pred_teste >= cutoff_ideal_treino) if train == 0
(1,042 missing values generated)

. 
. * Matriz de classifica√ß√£o detalhada
. estat class if train == 0

Logistic model for FoiPenalizadoSTJ

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        30            19  |         49
     -     |        26           111  |        137
-----------+--------------------------+-----------
   Total   |        56           130  |        186

Classified + if predicted Pr(D) >= .5
True D defined as FoiPenalizadoSTJ != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   53.57%
Specificity                     Pr( -|~D)   85.38%
Positive predictive value       Pr( D| +)   61.22%
Negative predictive value       Pr(~D| -)   81.02%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   14.62%
False - rate for true D         Pr( -| D)   46.43%
False + rate for classified +   Pr(~D| +)   38.78%
False - rate for classified -   Pr( D| -)   18.98%
--------------------------------------------------
Correctly classified                        75.81%
--------------------------------------------------

. 
. * Kappa
. kappaetc FoiPenalizadoSTJ predicted_class_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7204    0.0330  21.83   0.000     0.6553     0.7855
Brennan and Prediger |  0.4409    0.0660   6.68   0.000     0.3107     0.5711
Cohen/Conger's Kappa |  0.3424    0.0740   4.63   0.000     0.1964     0.4884
    Scott/Fleiss' Pi |  0.3423    0.0740   4.62   0.000     0.1962     0.4884
           Gwet's AC |  0.5137    0.0655   7.84   0.000     0.3845     0.6430
Krippendorff's Alpha |  0.3441    0.0740   4.65   0.000     0.1980     0.4902
------------------------------------------------------------------------------

. 
. * Acur√°cia
. capture drop correct_classification_teste

. gen correct_classification_teste = (FoiPenalizadoSTJ == predicted_class_teste) if train == 0
(1,042 missing values generated)

. sum correct_classification_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_cl~e |        186    .7204301    .4499992          0          1

. scalar prop_modelo_teste = r(mean)

. 
. * No Information Rate
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar prop_nir_teste = max_teste / total_teste

. 
. di "Acur√°cia (teste): " prop_modelo_teste
Acur√°cia (teste): .72043011

. di "NIR (teste): " prop_nir_teste
NIR (teste): .69892473

. 
. if (prop_modelo_teste > prop_nir_teste) {
.     di "‚úÖ Modelo stepwise 10% supera o NIR na base de teste (cutoff ideal do treino)."
‚úÖ Modelo stepwise 10% supera o NIR na base de teste (cutoff ideal do treino).
. }

. else {
.     di "‚ö†Ô∏è Modelo stepwise 10% N√ÉO supera o NIR na base de teste (cutoff ideal do treino)."
. }

. 
. * Teste de McNemar
. tabulate FoiPenalizadoSTJ predicted_class_teste if train == 0, matcell(mc_teste)

FoiPenaliz | predicted_class_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       103         27 |       130 
         1 |        25         31 |        56 
-----------+----------------------+----------
     Total |       128         58 |       186 

. scalar tn_teste = mc_teste[1,1]

. scalar fn_teste = mc_teste[2,1]

. scalar fp_teste = mc_teste[1,2]

. scalar tp_teste = mc_teste[2,2]

. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       103          25  |        128
       Unexposed |        27          31  |         58
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =      0.08    Prob > chi2 = 0.7815
Exact McNemar significance probability       = 0.8899

Proportion with factor
        Cases        .688172
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference -.0107527     -.0920999   .0705945
        ratio       .9846154      .8824356   1.098627
        rel. diff. -.0357143     -.2925656    .221137

        odds ratio  .9259259      .5154251   1.657359   (exact)

. 
. /*******************************************************************************
> 6.4 Teste de Raz√£o de Verossimilhan√ßa entre os Modelos Aninhados(LR Test)
> *******************************************************************************/
. 
. di "üìä Teste de Raz√£o de Verossimilhan√ßa: IRDCcompleto vs IRDC05 (stepwise 5%)"
üìä Teste de Raz√£o de Verossimilhan√ßa: IRDCcompleto vs IRDC05 (stepwise 5%)

. lrtest IRDCcompleto IRDC05

Likelihood-ratio test
Assumption: IRDC05 nested within IRDCcompleto

LR chi2(30) =  29.67
Prob > chi2 = 0.4826

. 
. di "üìä Teste de Raz√£o de Verossimilhan√ßa: IRDCcompleto vs IRDC10 (stepwise 10%)"
üìä Teste de Raz√£o de Verossimilhan√ßa: IRDCcompleto vs IRDC10 (stepwise 10%)

. lrtest IRDCcompleto IRDC10

Likelihood-ratio test
Assumption: IRDC10 nested within IRDCcompleto

LR chi2(23) =  12.17
Prob > chi2 = 0.9678

. 
. di "üìä Teste de Raz√£o de Verossimilhan√ßa: IRDC05 (stepwise 5%) vs IRDC10 (stepwise 10%)"
üìä Teste de Raz√£o de Verossimilhan√ßa: IRDC05 (stepwise 5%) vs IRDC10 (stepwise 10%)

. lrtest IRDC05 IRDC10

Likelihood-ratio test
Assumption: IRDC05 nested within IRDC10

 LR chi2(7) =  17.50
Prob > chi2 = 0.0144

. 
. /*******************************************************************************
> 6.5 Regress√£o log√≠stica com sele√ß√£o via LASSO (penaliza√ß√£o L1) no conjunto de treinamento
> 
>  O LASSO (Least Absolute Shrinkage and Selection Operator) realiza sele√ß√£o autom√°tica
> de vari√°veis e reduz o risco de overfitting (sobreajuste), especialmente √∫til em 
> modelos com muitas vari√°veis e potencial multicolinearidade.
> 
> *******************************************************************************/
. 
. * Capturar todas as vari√°veis que come√ßam com "Porte_"
. unab Porte_vars : Porte_*

. 
. * Capturar todas as vari√°veis que come√ßam com "CNAE_"
. unab CNAE_vars : CNAE_*

. 
. * Capturar todas as vari√°veis que come√ßam com "DivisaoCNAE_"
. unab DivisaoCNAE_vars : DivisaoCNAE_*

. 
. * Capturar todas as vari√°veis que come√ßam com "NaturezaJuridica_"
. unab Natureza_vars : NaturezaJuridica_*

. 
. * Definir vari√°veis cont√°beis e de controle corretamente
. local var_contabeis `Porte_vars' LiqCorrente LiqGeral LiqCorAjust SolvGeral EndGeral CompEndivid Ind
> epFin ImobilPL ImobRecNC PtpCapTerce GiroAtivo MargOp MargLiq ROI ROE

. 
. local var_controle `CNAE_vars' `Natureza_vars' log_vlrcon~o  QtdeCNAEsS~s IdadedeAnos QtePenalOu~s

. 
. *local var_controle `DivisaoCNAE_vars' `Natureza_vars' log_vlrcon~o  QtdeCNAEsS~s IdadedeAnos QtePen
> alOu~s
. 
. * Consolidar todas as vari√°veis em uma macro
. local todas_vars `var_contabeis' `var_controle'

. 
. *Ajustar modelo LASSO na base de treinamento
. lasso logit FoiPenalizadoSTJ `todas_vars' if train == 1, selection(cv)
note: NaturezaJuridica_1 omitted because it is constant.
note: PtpCapTerce omitted because of collinearity with another variable.
note: NaturezaJuridica_8 omitted because it is constant in C.V. subsamples.
10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1473939   no. of nonzero coef. =  0
Folds: 1...5....10   CVF = 1.388773
Grid value 2:     lambda = .1342998   no. of nonzero coef. =  1
Folds: 1...5....10   CVF = 1.377423
Grid value 3:     lambda =  .122369   no. of nonzero coef. =  1
Folds: 1...5....10   CVF = 1.364961
Grid value 4:     lambda = .1114981   no. of nonzero coef. =  3
Folds: 1...5....10   CVF = 1.348311
Grid value 5:     lambda = .1015929   no. of nonzero coef. =  4
Folds: 1...5....10   CVF = 1.325035
Grid value 6:     lambda = .0925677   no. of nonzero coef. =  4
Folds: 1...5....10   CVF = 1.300082
Grid value 7:     lambda = .0843442   no. of nonzero coef. =  4
Folds: 1...5....10   CVF = 1.278878
Grid value 8:     lambda = .0768513   no. of nonzero coef. =  4
Folds: 1...5....10   CVF = 1.260916
Grid value 9:     lambda =  .070024   no. of nonzero coef. =  6
Folds: 1...5....10   CVF =  1.24433
Grid value 10:    lambda = .0638033   no. of nonzero coef. =  8
Folds: 1...5....10   CVF = 1.224272
Grid value 11:    lambda = .0581352   no. of nonzero coef. = 12
Folds: 1...5....10   CVF = 1.199494
Grid value 12:    lambda = .0529706   no. of nonzero coef. = 16
Folds: 1...5....10   CVF = 1.170374
Grid value 13:    lambda = .0482649   no. of nonzero coef. = 22
Folds: 1...5....10   CVF = 1.138319
Grid value 14:    lambda = .0439771   no. of nonzero coef. = 24
Folds: 1...5....10   CVF = 1.103923
Grid value 15:    lambda = .0400703   no. of nonzero coef. = 27
Folds: 1...5....10   CVF = 1.069091
Grid value 16:    lambda = .0365106   no. of nonzero coef. = 28
Folds: 1...5....10   CVF = 1.037141
Grid value 17:    lambda = .0332671   no. of nonzero coef. = 28
Folds: 1...5....10   CVF = 1.008343
Grid value 18:    lambda = .0303117   no. of nonzero coef. = 32
Folds: 1...5....10   CVF = .9828123
Grid value 19:    lambda = .0276189   no. of nonzero coef. = 35
Folds: 1...5....10   CVF = .9595609
Grid value 20:    lambda = .0251653   no. of nonzero coef. = 36
Folds: 1...5....10   CVF = .9390273
Grid value 21:    lambda = .0229297   no. of nonzero coef. = 38
Folds: 1...5....10   CVF =  .920641
Grid value 22:    lambda = .0208927   no. of nonzero coef. = 39
Folds: 1...5....10   CVF = .9034204
Grid value 23:    lambda = .0190367   no. of nonzero coef. = 41
Folds: 1...5....10   CVF = .8870625
Grid value 24:    lambda = .0173455   no. of nonzero coef. = 42
Folds: 1...5....10   CVF = .8722326
Grid value 25:    lambda = .0158046   no. of nonzero coef. = 43
Folds: 1...5....10   CVF = .8592272
Grid value 26:    lambda = .0144005   no. of nonzero coef. = 43
Folds: 1...5....10   CVF =  .847831
Grid value 27:    lambda = .0131212   no. of nonzero coef. = 44
Folds: 1...5....10   CVF = .8377969
Grid value 28:    lambda = .0119556   no. of nonzero coef. = 44
Folds: 1...5....10   CVF = .8291013
Grid value 29:    lambda = .0108935   no. of nonzero coef. = 44
Folds: 1...5....10   CVF = .8215589
Grid value 30:    lambda = .0099257   no. of nonzero coef. = 44
Folds: 1...5....10   CVF = .8148696
Grid value 31:    lambda =  .009044   no. of nonzero coef. = 46
Folds: 1...5....10   CVF = .8088836
Grid value 32:    lambda = .0082405   no. of nonzero coef. = 49
Folds: 1...5....10   CVF = .8037288
Grid value 33:    lambda = .0075084   no. of nonzero coef. = 49
Folds: 1...5....10   CVF =  .799368
Grid value 34:    lambda = .0068414   no. of nonzero coef. = 49
Folds: 1...5....10   CVF = .7955495
Grid value 35:    lambda = .0062336   no. of nonzero coef. = 49
Folds: 1...5....10   CVF = .7924297
Grid value 36:    lambda = .0056799   no. of nonzero coef. = 50
Folds: 1...5....10   CVF = .7897484
Grid value 37:    lambda = .0051753   no. of nonzero coef. = 50
Folds: 1...5....10   CVF = .7875688
Grid value 38:    lambda = .0047155   no. of nonzero coef. = 50
Folds: 1...5....10   CVF = .7860222
Grid value 39:    lambda = .0042966   no. of nonzero coef. = 51
Folds: 1...5....10   CVF = .7848455
Grid value 40:    lambda = .0039149   no. of nonzero coef. = 52
Folds: 1...5....10   CVF = .7841282
Grid value 41:    lambda = .0035671   no. of nonzero coef. = 53
Folds: 1...5....10   CVF = .7836206
Grid value 42:    lambda = .0032502   no. of nonzero coef. = 54
Folds: 1...5....10   CVF = .7833356
Grid value 43:    lambda = .0029615   no. of nonzero coef. = 55
Folds: 1...5....10   CVF = .7832799
Grid value 44:    lambda = .0026984   no. of nonzero coef. = 57
Folds: 1...5....10   CVF = .7834369
Grid value 45:    lambda = .0024587   no. of nonzero coef. = 57
Folds: 1...5....10   CVF = .7836927
Grid value 46:    lambda = .0022403   no. of nonzero coef. = 57
Folds: 1...5....10   CVF = .7840725
Grid value 47:    lambda = .0020412   no. of nonzero coef. = 58
Folds: 1...5....10   CVF = .7845504
Grid value 48:    lambda = .0018599   no. of nonzero coef. = 58
Folds: 1...5....10   CVF = .7851104
... cross-validation complete ... minimum found

Lasso logit model                           No. of obs        =      1,042
                                            No. of covariates =         68
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
       1 |    first lambda    .1473939         0      -0.0018     1.388773
      42 |   lambda before    .0032502        54       0.4349     .7833356
    * 43 | selected lambda    .0029615        55       0.4350     .7832799
      44 |    lambda after    .0026984        57       0.4349     .7834369
      48 |     last lambda    .0018599        58       0.4337     .7851104
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. 
. * Salvar modelo
. estimates store IRDC_LASSO

. 
. 
. /*******************************************************************************
> 6.5.1 ‚Äì Exportar Coeficientes Selecionados do Modelo LASSO (via log + convers√£o via Python)
> *******************************************************************************/
. 
. * Garantir que qualquer log anterior esteja fechado
. capture log close lassolog

. 
. * Abrir log no diret√≥rio atual (o mesmo de execu√ß√£o)
. log using "coef_lasso.txt", name(lassolog) text replace
------------------------------------------------------------------------------------------------------
      name:  lassolog
       log:  C:\Users\morenos\OneDrive - STJ- Superior Tribunal de Justi√ßa\UnB\Mestrado em Governan√ßa 
> e Inova√ß√£o em Pol√≠ticas P√∫blicas\Projeto\Dados\Diretorio Stata\coef_lasso.txt
  log type:  text
 opened on:   5 Jun 2025, 19:13:08

. 
. * Exibir os coeficientes selecionados
. lassocoef, display(coef, postselection)

---------------------------------
                     | IRDC_LASSO
---------------------+-----------
             Porte_1 |  -1.483931
             Porte_2 |   .0944994
             Porte_3 |  -.7654147
           SolvGeral |   .0030023
            EndGeral |   .0771067
         CompEndivid |  -.1154793
            ImobilPL |  -.5737773
           GiroAtivo |  -.0761235
              MargOp |  -.5699209
             MargLiq |  -.6511823
                 ROI |  -.3410596
              CNAE_1 |  -1.559553
              CNAE_2 |  -17.27563
              CNAE_3 |   4.392298
              CNAE_4 |   17.69104
              CNAE_5 |  -.4291169
              CNAE_6 |   20.03461
              CNAE_7 |  -.2578369
              CNAE_8 |   1.024097
              CNAE_9 |   17.98182
             CNAE_10 |   17.95557
             CNAE_11 |   18.10001
             CNAE_13 |  -.4042249
             CNAE_14 |   18.45995
             CNAE_16 |  -.2525673
             CNAE_17 |   1.413657
             CNAE_18 |   1.515801
             CNAE_19 |  -1.165306
             CNAE_20 |  -17.69297
             CNAE_21 |  -1.931204
             CNAE_22 |  -18.23169
             CNAE_23 |   .7521555
             CNAE_24 |   18.46301
             CNAE_25 |    17.4564
             CNAE_26 |   18.93496
             CNAE_27 |  -2.175789
             CNAE_28 |   17.60555
             CNAE_30 |    2.68703
             CNAE_31 |  -18.18681
             CNAE_32 |  -.6447718
             CNAE_33 |   1.262154
             CNAE_34 |  -18.18385
             CNAE_35 |   -.468672
             CNAE_36 |  -18.16703
             CNAE_37 |  -18.18152
             CNAE_38 |   18.65148
  NaturezaJuridica_4 |  -2.475917
  NaturezaJuridica_5 |   1.210131
  NaturezaJuridica_7 |  -15.22853
  NaturezaJuridica_9 |   3.144294
 NaturezaJuridica_10 |  -15.89986
     log_vlrcontrato |   .0725862
QtdeCNAEsSecundarios |  -.0157101
         IdadedeAnos |   .0064918
QtePenalOutrosOrgaos |   .0318955
               _cons |  -.6082075
---------------------------------
Legend:
  b - base level
  e - empty cell
  o - omitted

. 
. * Fechar o log
. log close lassolog
      name:  lassolog
       log:  C:\Users\morenos\OneDrive - STJ- Superior Tribunal de Justi√ßa\UnB\Mestrado em Governan√ßa 
> e Inova√ß√£o em Pol√≠ticas P√∫blicas\Projeto\Dados\Diretorio Stata\coef_lasso.txt
  log type:  text
 closed on:   5 Jun 2025, 19:13:08
------------------------------------------------------------------------------------------------------

. 
. display "‚úÖ coef_lasso.txt exportado com sucesso."
‚úÖ coef_lasso.txt exportado com sucesso.

. 
. 
. /*******************************************************************************
> 6.5.2 Tabela de Classifica√ß√£o, Acur√°cia, NIR e Teste de McNemar para o 
> Modelo LASSO na base de treino
> *******************************************************************************/
. 
. * üìå Gerar predi√ß√µes de probabilidade na base de treinamento
. capture drop prob_pred_lasso

. predict prob_pred_lasso if train == 1, xb
(option penalized assumed; linear prediction with penalized coefficients)

. 
. * üìå Classifica√ß√£o prevista com cutoff 0.5
. capture drop pred_lasso

. gen pred_lasso = (prob_pred_lasso >= 0.5) if train == 1
(186 missing values generated)

. 
. * üìå Kappa
. kappaetc FoiPenalizadoSTJ pred_lasso if train == 1

Interrater agreement                             Number of subjects =    1042
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.8301    0.0116  71.33   0.000     0.8073     0.8530
Brennan and Prediger |  0.6603    0.0233  28.37   0.000     0.6146     0.7059
Cohen/Conger's Kappa |  0.6603    0.0228  29.01   0.000     0.6156     0.7049
    Scott/Fleiss' Pi |  0.6565    0.0235  27.92   0.000     0.6104     0.7027
           Gwet's AC |  0.6639    0.0232  28.61   0.000     0.6184     0.7095
Krippendorff's Alpha |  0.6567    0.0235  27.92   0.000     0.6105     0.7028
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de treinamento
. capture drop correct_lasso

. gen correct_lasso = (FoiPenalizadoSTJ == pred_lasso) if train == 1
(186 missing values generated)

. sum correct_lasso if train == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_la~o |      1,042    .8301344     .375695          0          1

. scalar acuracia = r(mean)

. 
. * üìå No Information Rate (NIR)
. * O NIR representa a acur√°cia de um modelo nulo (baseline), que classifica sempre a categoria mais f
> requente
. tabulate FoiPenalizadoSTJ if train == 1, matcell(freq_lasso)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521       50.00       50.00
          1 |        521       50.00      100.00
------------+-----------------------------------
      Total |      1,042      100.00

. scalar total_lasso = freq_lasso[1,1] + freq_lasso[2,1]

. scalar max_lasso = max(freq_lasso[1,1], freq_lasso[2,1])

. scalar prop_nir_lasso = max_lasso / total_lasso

. 
. * üìå Compara√ß√£o
. di "Acur√°cia LASSO na base de treinamento: " acuracia
Acur√°cia LASSO na base de treinamento: .83013436

. di "NIR (treinamento): " prop_nir_lasso
NIR (treinamento): .5

. 
. if (acuracia > prop_nir_lasso) {
.     di "‚úÖ Modelo LASSO supera o NIR na base de treino."
‚úÖ Modelo LASSO supera o NIR na base de treino.
. }

. else {
.     di "‚ö†Ô∏è Modelo LASSO N√ÉO supera o NIR na base de treino."
. }

. 
. * üìå Teste de McNemar na base de treinamento
. tabulate FoiPenalizadoSTJ pred_lasso if train == 1, matcell(mc_lasso)

FoiPenaliz |      pred_lasso
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       487         34 |       521 
         1 |       143        378 |       521 
-----------+----------------------+----------
     Total |       630        412 |     1,042 

. 
. scalar tn_lasso = mc_lasso[1,1] // Verdadeiro Negativo

. scalar fn_lasso = mc_lasso[2,1] // Falso Negativo

. scalar fp_lasso = mc_lasso[1,2] // Falso Positivo

. scalar tp_lasso = mc_lasso[2,2] // Verdadeiro Positivo

. 
. * Mostrar os valores extra√≠dos (opcional)
. di "TN: " tn_lasso
TN: 487

. di "FN: " fn_lasso
FN: 143

. di "FP: " fp_lasso
FP: 34

. di "TP: " tp_lasso
TP: 378

. 
. * Rodar o teste de McNemar com os valores num√©ricos
. mcci `=tn_lasso' `=fn_lasso' `=fp_lasso' `=tp_lasso'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       487         143  |        630
       Unexposed |        34         378  |        412
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =     67.12    Prob > chi2 = 0.0000
Exact McNemar significance probability       = 0.0000

Proportion with factor
        Cases       .6046065
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference  .1046065      .0794417   .1297714
        ratio       1.209213      1.155411   1.265521
        rel. diff.  .2092131      .1647062   .2537199

        odds ratio  4.205882      2.876808   6.307347   (exact)

. 
. /*******************************************************************************
> 6.5.3 Curva ROC para o modelo LASSO na base de TREINO
> *******************************************************************************/
. capture drop prob_pred_lasso_treino

. predict prob_pred_lasso_treino if train == 1, xb
(option penalized assumed; linear prediction with penalized coefficients)

. roctab FoiPenalizadoSTJ prob_pred_lasso_treino if train == 1, graph

. graph export "ROC_LASSO_treino.png", replace
file ROC_LASSO_treino.png saved as PNG format

. 
. /*******************************************************************************
> 6.5.4 Avalia√ß√£o do modelo LASSO na base de TESTE
> *******************************************************************************/
. 
. * üìå Gerar predi√ß√µes de probabilidade na base de teste
. capture drop prob_pred_lasso_teste

. predict prob_pred_lasso_teste if train == 0, xb
(option penalized assumed; linear prediction with penalized coefficients)

. 
. * üìå Classifica√ß√£o prevista com cutoff 0.5
. capture drop pred_lasso_teste

. gen pred_lasso_teste = (prob_pred_lasso_teste >= 0.5) if train == 0
(1,042 missing values generated)

. 
. * üìå Kappa na base de teste
. kappaetc FoiPenalizadoSTJ pred_lasso_teste if train == 0

Interrater agreement                             Number of subjects =     186
                                                Ratings per subject =       2
                                        Number of rating categories =       2
------------------------------------------------------------------------------
                     |   Coef.  Std. Err.    t    P>|t|   [95% Conf. Interval]
---------------------+--------------------------------------------------------
   Percent Agreement |  0.7903    0.0299  26.41   0.000     0.7313     0.8494
Brennan and Prediger |  0.5806    0.0599   9.70   0.000     0.4626     0.6987
Cohen/Conger's Kappa |  0.4423    0.0730   6.06   0.000     0.2983     0.5862
    Scott/Fleiss' Pi |  0.4326    0.0766   5.65   0.000     0.2816     0.5837
           Gwet's AC |  0.6674    0.0544  12.27   0.000     0.5601     0.7747
Krippendorff's Alpha |  0.4342    0.0766   5.67   0.000     0.2831     0.5852
------------------------------------------------------------------------------

. 
. * üìå Acur√°cia na base de teste
. capture drop correct_lasso_teste

. gen correct_lasso_teste = (FoiPenalizadoSTJ == pred_lasso_teste) if train == 0
(1,042 missing values generated)

. sum correct_lasso_teste if train == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
correct_la~e |        186    .7903226    .4081771          0          1

. scalar acuracia_teste = r(mean)

. 
. * üìå No Information Rate (NIR) - TESTE
. tabulate FoiPenalizadoSTJ if train == 0, matcell(freq_teste)

FoiPenaliza |
      doSTJ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       69.89       69.89
          1 |         56       30.11      100.00
------------+-----------------------------------
      Total |        186      100.00

. scalar total_teste = freq_teste[1,1] + freq_teste[2,1]

. scalar max_teste = max(freq_teste[1,1], freq_teste[2,1])

. scalar nir_teste = max_teste / total_teste

. 
. di "Acur√°cia LASSO (teste): " acuracia_teste
Acur√°cia LASSO (teste): .79032258

. di "NIR (teste): " nir_teste
NIR (teste): .69892473

. 
. if (acuracia_teste > nir_teste) {
.     di "‚úÖ Modelo LASSO supera o NIR na base de teste."
‚úÖ Modelo LASSO supera o NIR na base de teste.
. }

. else {
.     di "‚ö†Ô∏è Modelo LASSO N√ÉO supera o NIR na base de teste."
. }

. 
. * üìå Teste de McNemar - TESTE
. tabulate FoiPenalizadoSTJ pred_lasso_teste if train == 0, matcell(mc_lasso_teste)

FoiPenaliz |   pred_lasso_teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       121          9 |       130 
         1 |        30         26 |        56 
-----------+----------------------+----------
     Total |       151         35 |       186 

. 
. scalar tn_teste = mc_lasso_teste[1,1]

. scalar fn_teste = mc_lasso_teste[2,1]

. scalar fp_teste = mc_lasso_teste[1,2]

. scalar tp_teste = mc_lasso_teste[2,2]

. 
. di "TN: " tn_teste
TN: 121

. di "FN: " fn_teste
FN: 30

. di "FP: " fp_teste
FP: 9

. di "TP: " tp_teste
TP: 26

. 
. mcci `=tn_teste' `=fn_teste' `=fp_teste' `=tp_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       121          30  |        151
       Unexposed |         9          26  |         35
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =     11.31    Prob > chi2 = 0.0008
Exact McNemar significance probability       = 0.0011

Proportion with factor
        Cases        .811828
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference  .1129032      .0437523   .1820542
        ratio       1.161538      1.064371   1.267577
        rel. diff.      .375      .2022045   .5477955

        odds ratio  3.333333      1.542837   7.981745   (exact)

. 
. /*******************************************************************************
> 6.5.5 Curva ROC para o modelo LASSO na base de TESTE
> *******************************************************************************/
. roctab FoiPenalizadoSTJ prob_pred_lasso_teste if train == 0, graph

. graph export "ROC_LASSO_teste.png", replace
file ROC_LASSO_teste.png saved as PNG format

. 
. /*******************************************************************************
> 6.5.6 ‚Äì Classifica√ß√£o com Cutoff M√©dio (modelo LASSO)
> *******************************************************************************/
. 
. * üìå Definir o cutoff m√©dio com base nos modelos completos, stepwise 5% e stepwise 10%
. scalar cutoff_medio = (cutoff_completo + cutoff_step05 + cutoff_step10) / 3

. di "üìå Cutoff m√©dio dos modelos: " cutoff_medio
üìå Cutoff m√©dio dos modelos: .45717189

. 
. * ========================================================
. * BASE DE TREINAMENTO
. * ========================================================
. 
. * üìå Gerar classifica√ß√£o com cutoff m√©dio
. capture drop predicted_class_lasso_treino

. gen predicted_class_lasso_treino = (prob_pred_lasso_treino >= cutoff_medio) if train == 1
(186 missing values generated)

. 
. * üìå Matriz de classifica√ß√£o com tabula√ß√£o
. tabulate FoiPenalizadoSTJ predicted_class_lasso_treino if train == 1, matcell(mc_lasso_treino)

           | predicted_class_lasso
FoiPenaliz |        _treino
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       486         35 |       521 
         1 |       141        380 |       521 
-----------+----------------------+----------
     Total |       627        415 |     1,042 

. 
. * üìå Extrair valores
. scalar tn_lasso_medio = mc_lasso_treino[1,1]

. scalar fn_lasso_medio = mc_lasso_treino[2,1]

. scalar fp_lasso_medio = mc_lasso_treino[1,2]

. scalar tp_lasso_medio = mc_lasso_treino[2,2]

. 
. * üìå Teste de McNemar
. mcci `=tn_lasso_medio' `=fn_lasso_medio' `=fp_lasso_medio' `=tp_lasso_medio'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       486         141  |        627
       Unexposed |        35         380  |        415
-----------------+------------------------+-----------
           Total |       521         521  |       1042

McNemar's chi2(1) =     63.84    Prob > chi2 = 0.0000
Exact McNemar significance probability       = 0.0000

Proportion with factor
        Cases       .6017274
        Controls          .5     [95% conf. interval]
                   ---------     --------------------
        difference  .1017274      .0765905   .1268644
        ratio       1.203455      1.149932   1.259469
        rel. diff.  .2034549      .1589127   .2479971

        odds ratio  4.028571      2.765616   6.012748   (exact)

. 
. * ========================================================
. * BASE DE TESTE
. * ========================================================
. 
. * üìå Gerar classifica√ß√£o com cutoff m√©dio
. capture drop predicted_class_lasso_teste

. gen predicted_class_lasso_teste = (prob_pred_lasso_teste >= cutoff_medio) if train == 0
(1,042 missing values generated)

. 
. * üìå Matriz de classifica√ß√£o com tabula√ß√£o
. tabulate FoiPenalizadoSTJ predicted_class_lasso_teste if train == 0, matcell(mc_lasso_teste)

           | predicted_class_lasso
FoiPenaliz |        _teste
    adoSTJ |         0          1 |     Total
-----------+----------------------+----------
         0 |       121          9 |       130 
         1 |        30         26 |        56 
-----------+----------------------+----------
     Total |       151         35 |       186 

. 
. * üìå Extrair valores
. scalar tn_lasso_medio_teste = mc_lasso_teste[1,1]

. scalar fn_lasso_medio_teste = mc_lasso_teste[2,1]

. scalar fp_lasso_medio_teste = mc_lasso_teste[1,2]

. scalar tp_lasso_medio_teste = mc_lasso_teste[2,2]

. 
. * üìå Teste de McNemar
. mcci `=tn_lasso_medio_teste' `=fn_lasso_medio_teste' `=fp_lasso_medio_teste' `=tp_lasso_medio_teste'

                 |        Controls        |
Cases            |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
         Exposed |       121          30  |        151
       Unexposed |         9          26  |         35
-----------------+------------------------+-----------
           Total |       130          56  |        186

McNemar's chi2(1) =     11.31    Prob > chi2 = 0.0008
Exact McNemar significance probability       = 0.0011

Proportion with factor
        Cases        .811828
        Controls    .6989247     [95% conf. interval]
                   ---------     --------------------
        difference  .1129032      .0437523   .1820542
        ratio       1.161538      1.064371   1.267577
        rel. diff.      .375      .2022045   .5477955

        odds ratio  3.333333      1.542837   7.981745   (exact)

. 
. /*******************************************************************************
> FIM DO SCRIPT
> *******************************************************************************/
. 
. log off
no log file open
r(606);

end of do-file

r(606);

. exit, clear
